exec("".join(map(chr,[int("".join(str({'अ': 0,
 'आ': 1,
 'इ': 2,
 'ई': 3,
 'उ': 4,
 'ऊ': 5,
 'ए': 6,
 'ऐ': 7,
 'ओ': 8,
 'औ': 9,
 'क': 10,
 'ख': 11,
 'ग': 12,
 'घ': 13,
 'ङ': 14,
 'च': 15,
 'छ': 16,
 'ज': 17,
 'झ': 18,
 'ञ': 19,
 'ट': 20,
 'ठ': 21,
 'ड': 22,
 'ढ': 23,
 'ण': 24,
 'त': 25,
 'थ': 26,
 'द': 27,
 'ध': 28,
 'न': 29,
 'प': 30,
 'फ': 31,
 'ब': 32,
 'भ': 33,
 'म': 34,
 'य': 35,
 'र': 36,
 'ल': 37,
 'व': 38,
 'श': 39,
 'ष': 40,
 'स': 41,
 'ह': 42}[i]) for i in x.split())) for x in
"ई ऊ  ई ई  उ ऐ  आ आ ऐ  आ आ ऊ  आ आ उ  उ ऐ  औ ओ  आ अ ऊ  आ आ अ  उ ऐ  आ अ आ\
  आ आ अ  आ आ ओ  ई इ  आ आ इ  आ इ आ  आ आ ए  आ अ उ  आ आ आ  आ आ अ  ऊ आ  आ \
अ  ई उ  ई उ  ई उ  आ अ  ओ उ  आ अ आ  आ आ ऊ  आ आ ए  ई इ  आ आ ऊ  औ औ  आ आ \
उ  आ अ ऊ  आ आ इ  आ आ ए  ई इ  आ अ इ  आ आ आ  आ आ उ  ई इ  ऐ ऊ  औ ऐ  आ आ अ\
  आ आ अ  औ ऐ  आ अ अ  औ ऐ  आ अ इ  आ इ आ  ई इ  आ आ आ  औ ओ  आ अ इ  आ आ ऐ \
 आ आ ऊ  औ औ  औ ऐ  आ आ ए  आ अ ऊ  आ आ आ  आ आ अ  उ ए  आ अ  ओ उ  आ अ उ  आ \
अ ऊ  आ आ ऊ  ई इ  आ आ ऊ  औ औ  आ आ उ  आ अ ऊ  आ आ इ  आ आ ए  ई इ  औ औ  आ आ\
 आ  आ आ अ  आ आ ए  औ ऐ  आ अ ऊ  आ आ अ  आ आ ऊ  ई इ  आ आ ओ  औ ऐ  आ आ उ  आ \
अ ऊ  आ आ आ  आ आ ऐ  आ आ ऊ  ई इ  ओ अ  आ इ आ  आ आ ए  आ अ उ  आ आ आ  आ आ अ \
 ई इ  आ अ इ  आ अ आ  औ ऐ  आ आ ए  आ आ ऐ  आ आ उ  आ अ आ  आ आ ऊ  ई इ  आ आ ए\
  आ आ आ  ई इ  आ आ ए  आ अ आ  आ आ ऊ  आ आ ए  ई इ  आ आ ए  आ अ उ  आ अ आ  ई \
इ  आ आ आ  औ ओ  आ अ इ  आ आ ऐ  आ आ ऊ  औ औ  औ ऐ  आ आ ए  आ अ ऊ  आ आ आ  आ आ\
 अ  ई इ  आ आ इ  आ आ उ  आ आ आ  औ औ  आ अ आ  आ आ ऊ  आ आ ऊ  उ ए  आ अ  ई उ \
 ई उ  ई उ  आ अ  आ अ  आ अ अ  आ अ आ  आ अ इ  ई इ  औ औ  औ ऐ  आ अ ओ  औ औ  आ\
 आ ऐ  आ अ ओ  औ ऐ  आ आ ए  आ अ आ  औ ऊ  आ अ इ  आ अ ऊ  औ ओ  आ आ आ  आ आ अ  \
औ ऐ  औ औ  औ औ  आ अ ऊ  उ अ  आ आ अ  उ आ  ऊ ओ  आ अ  ई इ  ई इ  ई इ  ई इ  ई\
 उ  ई उ  ई उ  ए ऐ  औ ऐ  आ अ ओ  औ औ  आ आ ऐ  आ अ ओ  औ ऐ  आ आ ए  आ अ आ  ई\
 इ  आ आ ए  आ अ उ  आ अ आ  ई इ  आ आ अ  आ आ ए  आ अ उ  ई इ  ऐ अ  आ अ ऊ  औ \
ओ  आ आ आ  आ आ अ  औ ऐ  औ औ  औ औ  आ अ ऊ  ई इ  आ आ अ  आ आ ऐ  आ अ औ  औ ओ  \
आ अ आ  आ आ उ  ई इ  आ आ उ  आ अ आ  औ औ  आ आ ऐ  आ आ उ  आ आ ऊ  आ अ ऊ  आ आ \
ओ  आ अ आ  आ अ ओ  आ इ आ  उ ए  ई उ  ई उ  ई उ  आ अ  ई इ  ई इ  ई इ  ई इ  आ\
 अ ऊ  आ अ इ  ई इ  आ आ अ  ई इ  ए अ  ए आ  ई इ  उ औ  ऊ ओ  आ अ  ई इ  ई इ  \
ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  आ आ उ  आ अ आ  आ आ ए  आ आ ऐ  आ आ उ  आ आ अ\
  ई इ  आ आ अ  आ अ  ई इ  ई इ  ई इ  ई इ  आ आ उ  आ अ आ  आ आ ए  आ आ ऐ  आ आ\
 उ  आ आ अ  ई इ  औ औ  औ ऐ  आ अ ओ  औ औ  आ आ ऐ  आ अ ओ  औ ऐ  आ आ ए  आ अ आ \
 औ ऊ  आ अ इ  आ अ ऊ  औ ओ  आ आ आ  आ आ अ  औ ऐ  औ औ  औ औ  आ अ ऊ  उ अ  आ आ \
अ  उ ऊ  उ औ  उ आ  ई इ  उ ई  ई इ  औ औ  औ ऐ  आ अ ओ  औ औ  आ आ ऐ  आ अ ओ  औ\
 ऐ  आ आ ए  आ अ आ  औ ऊ  आ अ इ  आ अ ऊ  औ ओ  आ आ आ  आ आ अ  औ ऐ  औ औ  औ औ \
 आ अ ऊ  उ अ  आ आ अ  उ ऊ  ऊ अ  उ आ  आ अ  आ अ  आ अ अ  आ अ आ  आ अ इ  ई इ \
 आ अ ओ  आ अ ऊ  आ आ ऊ  आ आ ए  औ ऊ  औ औ  आ आ आ  आ अ औ  आ आ इ  आ आ उ  आ अ\
 आ  आ अ उ  आ अ आ  आ आ अ  आ आ ऊ  आ अ ऊ  आ आ आ  आ आ अ  औ ऊ  आ अ आ  आ इ अ\
  औ ऐ  आ अ औ  आ आ इ  आ अ ओ  आ अ आ  उ अ  उ आ  ऊ ओ  आ अ  ई इ  ई इ  ई इ  \
ई इ  ई उ  ई उ  ई उ  ए ओ  आ अ आ  आ अ औ  आ आ आ  आ आ अ  आ आ ऊ  आ आ ए  आ आ\
 उ  औ ऐ  आ आ ए  आ अ आ  ई इ  आ अ ओ  आ अ ऊ  आ आ ऊ  आ आ ए  ई इ  औ औ  आ आ \
आ  आ अ औ  आ आ इ  आ आ उ  आ अ आ  आ अ उ  आ अ आ  आ आ अ  आ आ ऊ  आ अ ऊ  आ आ \
आ  आ आ अ  उ ए  ई उ  ई उ  ई उ  आ अ  ई इ  ई इ  ई इ  ई इ  आ आ उ  आ अ आ  आ\
 आ ए  आ आ ऐ  आ आ उ  आ आ अ  ई इ  औ आ  आ इ अ  उ इ  उ इ  ऊ अ  ई इ  आ अ इ \
 आ आ आ  आ आ उ  ई इ  आ इ अ  ई इ  आ अ ऊ  आ आ अ  ई इ  आ आ उ  औ ऐ  आ आ अ  \
आ अ ई  आ अ आ  उ अ  उ औ  उ ओ  उ आ  ई इ  आ अ ऊ  आ अ इ  ई इ  आ इ अ  ई इ  \
ई ऐ  ई इ  ऊ अ  ई इ  ए आ  ए आ  ई इ  उ ओ  औ ई  आ अ  आ अ  औ औ  आ अ ओ  औ ऐ\
  आ आ ऊ  आ आ ऊ  ई इ  ओ उ  आ अ आ  आ आ ऊ  आ आ ए  ए ऐ  आ अ ओ  औ ऐ  आ आ ऊ \
 आ आ ऊ  ऊ ओ  आ अ  ई इ  ई इ  ई इ  ई इ  ई उ  ई उ  ई उ  ए ऊ  ई इ  आ आ ऊ  \
आ अ ऊ  आ अ औ  आ आ इ  आ अ ओ  आ अ आ  ई इ  औ औ  आ अ ओ  औ ऐ  आ आ ऊ  आ आ ऊ \
 ई इ  आ आ ए  आ आ आ  ई इ  आ आ ए  आ अ आ  आ आ ऊ  आ आ ए  ई इ  आ आ आ  औ ओ  \
आ अ इ  आ आ ऐ  आ आ ऊ  औ औ  औ ऐ  आ आ ए  आ अ ऊ  आ आ आ  आ आ अ  ई इ  आ आ औ \
 आ अ ऊ  आ आ ए  आ अ उ  ई इ  औ औ  आ अ ओ  औ ऐ  आ आ ऊ  आ आ ऊ  आ अ आ  आ आ ऊ\
  उ ए  ई उ  ई उ  ई उ  आ अ  आ अ  ई इ  ई इ  ई इ  ई इ  आ अ अ  आ अ आ  आ अ \
इ  ई इ  औ ऊ  औ ऊ  आ अ ऊ  आ आ अ  आ अ ऊ  आ आ ए  औ ऊ  औ ऊ  उ अ  आ आ ऊ  आ \
अ आ  आ अ ओ  आ अ इ  उ उ  ई इ  आ आ अ  औ ऐ  आ अ औ  आ अ आ  उ आ  ऊ ओ  आ अ  \
ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  आ आ ऊ  आ अ आ  आ अ ओ  आ अ इ  उ \
ए  आ आ अ  औ ऐ  आ अ औ  आ अ आ  ई इ  ए आ  ई इ  आ आ अ  औ ऐ  आ अ औ  आ अ आ  \
आ अ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  आ आ ऊ  आ अ आ  आ अ ओ  आ अ \
इ  उ ए  आ आ ओ  औ ऐ  आ अ ओ  आ आ ऐ  आ अ आ  ई इ  ए आ  ई इ  उ ओ  आ अ  आ अ \
 ई इ  ई इ  ई इ  ई इ  आ अ अ  आ अ आ  आ अ इ  ई इ  आ अ ऊ  आ आ अ  औ औ  आ आ \
उ  आ अ आ  आ अ औ  आ अ आ  आ आ अ  आ आ ए  उ अ  आ आ ऊ  आ अ आ  आ अ ओ  आ अ इ \
 उ उ  ई इ  औ ऐ  आ अ औ  आ आ आ  आ आ ऐ  आ आ अ  आ आ ए  ए आ  उ औ  उ आ  ऊ ओ \
 आ अ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई उ  ई उ  ई उ  ऐ ई  आ आ \
अ  औ औ  आ आ उ  आ अ आ  आ अ औ  आ अ आ  आ आ अ  आ आ ए  ई इ  आ आ ए  आ अ उ  आ\
 अ आ  ई इ  आ आ ओ  औ ऐ  आ अ ओ  आ आ ऐ  आ अ आ  ई इ  औ ओ  आ इ आ  ई इ  आ आ \
ए  आ अ उ  आ अ आ  ई इ  आ अ ई  आ अ ऊ  आ आ ओ  आ अ आ  आ आ अ  ई इ  औ ऐ  आ अ\
 औ  आ आ आ  आ आ ऐ  आ आ अ  आ आ ए  उ ए  ई उ  ई उ  ई उ  आ अ  ई इ  ई इ  ई इ\
  ई इ  ई इ  ई इ  ई इ  ई इ  आ आ ऊ  आ अ आ  आ अ ओ  आ अ इ  उ ए  आ आ ओ  औ ऐ\
  आ अ ओ  आ आ ऐ  आ अ आ  ई इ  उ ई  ए आ  ई इ  औ ऐ  आ अ औ  आ आ आ  आ आ ऐ  आ\
 आ अ  आ आ ए  आ अ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  आ आ उ  आ अ आ\
  आ आ ए  आ आ ऐ  आ आ उ  आ आ अ  ई इ  आ आ ऊ  आ अ आ  आ अ ओ  आ अ इ  उ ए  आ \
आ ओ  औ ऐ  आ अ ओ  आ आ ऐ  आ अ आ  आ अ  आ अ  ई इ  ई इ  ई इ  ई इ  आ अ अ  आ \
अ आ  आ अ इ  ई इ  औ ऊ  औ ऊ  आ आ ऊ  आ आ ए  आ आ उ  औ ऊ  औ ऊ  उ अ  आ आ ऊ  \
आ अ आ  आ अ ओ  आ अ इ  उ आ  ऊ ओ  आ अ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ  ई इ \
 ई इ  आ आ उ  आ अ आ  आ आ ए  आ आ ऐ  आ आ उ  आ आ अ  ई इ  आ अ इ  ई उ  ओ उ  \
आ अ आ  आ आ ऊ  आ आ ए  ए ऐ  आ अ ओ  औ ऐ  आ आ ऊ  आ आ ऊ  उ अ  आ आ अ  औ ऐ  आ\
 अ औ  आ अ आ  ए आ  ई औ  आ इ ई  आ आ ऊ  आ अ आ  आ अ ओ  आ अ इ  उ ए  आ आ अ  \
औ ऐ  आ अ औ  आ अ आ  आ इ ऊ  ई औ  उ उ  ई इ  आ आ ओ  औ ऐ  आ अ ओ  आ आ ऐ  आ अ\
 आ  ए आ  आ इ ई  आ आ ऊ  आ अ आ  आ अ ओ  आ अ इ  उ ए  आ आ ओ  औ ऐ  आ अ ओ  आ \
आ ऐ  आ अ आ  आ इ ऊ  उ आ  ई उ  आ अ  आ अ  आ अ अ  आ अ आ  आ अ इ  ई इ  आ अ औ\
  औ ऐ  आ अ ऊ  आ आ अ  उ अ  उ आ  ऊ ओ  आ अ  ई इ  ई इ  ई इ  ई इ  ई उ  ई उ \
 ई उ  ऐ ऐ  औ ऐ  आ अ ऊ  आ आ अ  ई इ  आ अ इ  आ आ ऐ  आ आ अ  औ औ  आ आ ए  आ \
अ ऊ  आ आ आ  आ आ अ  ई इ  आ आ ए  आ आ आ  ई इ  आ अ अ  आ अ आ  आ अ औ  आ आ आ \
 आ आ अ  आ आ ऊ  आ आ ए  आ आ उ  औ ऐ  आ आ ए  आ अ आ  ई इ  आ आ ए  आ अ उ  आ अ\
 आ  ई इ  आ अ इ  आ आ ऐ  आ आ अ  औ औ  आ आ ए  आ अ ऊ  आ आ आ  आ आ अ  औ ऐ  आ \
अ ओ  आ अ ऊ  आ आ ए  आ इ आ  उ ए  ई उ  ई उ  ई उ  आ अ  ई इ  ई इ  ई इ  ई इ \
 ई ऊ  ई इ  ओ ई  आ अ ऊ  आ अ औ  आ आ इ  आ अ ओ  आ अ आ  ई इ  औ औ  औ ऐ  आ अ \
ओ  औ औ  आ आ ऐ  आ अ ओ  औ ऐ  आ आ ए  आ अ ऊ  आ आ आ  आ आ अ  आ आ ऊ  आ अ  ई इ\
  ई इ  ई इ  ई इ  आ आ इ  आ आ उ  आ अ ऊ  आ आ अ  आ आ ए  उ अ  ई उ  ओ उ  आ अ\
 आ  आ आ ऊ  आ आ ए  आ अ ऊ  आ आ अ  आ अ ई  ई इ  ऐ ऊ  औ ऐ  आ आ अ  आ आ अ  औ \
ऐ  आ अ अ  औ ऐ  आ अ इ  आ इ आ  ई इ  आ आ आ  औ ओ  आ अ इ  आ आ ऐ  आ आ ऊ  औ औ\
  औ ऐ  आ आ ए  आ अ ऊ  आ आ आ  आ आ अ  उ ए  उ ए  उ ए  ई उ  उ आ  आ अ  आ अ  \
ई इ  ई इ  ई इ  ई इ  ई ऊ  ई इ  ए ऐ  औ ऐ  आ अ ओ  औ औ  आ आ ऐ  आ अ ओ  औ ऐ \
 आ आ ए  आ अ आ  ई इ  ऐ अ  आ अ ऊ  औ ओ  आ आ आ  आ आ अ  औ ऐ  औ औ  औ औ  आ अ \
ऊ  आ अ  ई इ  ई इ  ई इ  ई इ  आ अ इ  आ अ ऊ  औ ओ  औ ऊ  आ आ अ  आ आ ऐ  आ अ \
औ  ई इ  ए आ  ई इ  औ औ  औ ऐ  आ अ ओ  औ औ  आ आ ऐ  आ अ ओ  औ ऐ  आ आ ए  आ अ \
आ  औ ऊ  आ अ इ  आ अ ऊ  औ ओ  आ आ आ  आ आ अ  औ ऐ  औ औ  औ औ  आ अ ऊ  उ अ  उ \
औ  उ ओ  उ आ  आ अ  ई इ  ई इ  ई इ  ई इ  आ आ इ  आ आ उ  आ अ ऊ  आ आ अ  आ आ \
ए  उ अ  आ अ इ  ई उ  ऐ अ  आ अ ऊ  औ ओ  आ आ आ  आ आ अ  औ ऐ  औ औ  औ औ  आ अ \
ऊ  उ अ  उ औ  उ ओ  उ आ  ई इ  ए आ  ई इ  आ इ ई  आ अ इ  आ अ ऊ  औ ओ  औ ऊ  आ\
 आ अ  आ आ ऐ  आ अ औ  आ इ ऊ  ई उ  उ आ  आ अ  आ अ  ई इ  ई इ  ई इ  ई इ  ई ऊ\
  ई इ  ऐ ए  आ अ ऊ  आ आ ऊ  आ आ ए  ई इ  औ औ  आ आ आ  आ अ औ  आ आ इ  आ आ उ \
 आ अ आ  आ अ उ  आ अ आ  आ आ अ  आ आ ऊ  आ अ ऊ  आ आ आ  आ आ अ  आ अ  ई इ  ई इ\
  ई इ  ई इ  आ अ आ  आ आ ओ  आ अ आ  आ आ अ  औ ऊ  आ आ ऊ  आ आ ई  आ आ ऐ  औ ऐ \
 आ आ उ  आ अ आ  आ आ ऊ  ई इ  ए आ  ई इ  आ अ ओ  आ अ ऊ  आ आ ऊ  आ आ ए  औ ऊ  \
औ औ  आ आ आ  आ अ औ  आ आ इ  आ आ उ  आ अ आ  आ अ उ  आ अ आ  आ आ अ  आ आ ऊ  आ \
अ ऊ  आ आ आ  आ आ अ  औ ऊ  आ अ आ  आ इ अ  औ ऐ  आ अ औ  आ आ इ  आ अ ओ  आ अ आ \
 उ अ  उ आ  आ अ  ई इ  ई इ  ई इ  ई इ  आ आ इ  आ आ उ  आ अ ऊ  आ आ अ  आ आ ए \
 उ अ  आ अ इ  ई उ  ए औ  आ आ ओ  आ अ आ  आ आ अ  ई इ  आ आ ऊ  आ आ ई  आ आ ऐ  \
औ ऐ  आ आ उ  आ अ आ  आ आ ऊ  ऊ ओ  ई इ  आ इ ई  आ अ आ  आ आ ओ  आ अ आ  आ आ अ \
 औ ऊ  आ आ ऊ  आ आ ई  आ आ ऐ  औ ऐ  आ आ उ  आ अ आ  आ आ ऊ  आ इ ऊ  ई उ  उ आ  \
आ अ  आ अ  ई इ  ई इ  ई इ  ई इ  ई ऊ  ई इ  ए ऐ  आ अ ओ  औ ऐ  आ आ ऊ  आ आ ऊ \
 ई इ  आ आ ऐ  आ आ ऊ  औ ऐ  आ अ ई  आ अ आ  आ अ  ई इ  ई इ  ई इ  ई इ  आ आ ए \
 आ अ आ  आ आ ऊ  आ आ ए  औ ऊ  आ आ आ  औ ओ  आ अ ए  ई इ  ए आ  ई इ  ओ उ  आ अ \
आ  आ आ ऊ  आ आ ए  ए ऐ  आ अ ओ  औ ऐ  आ आ ऊ  आ आ ऊ  उ अ  ई उ  आ आ ए  आ अ आ\
  आ आ ऊ  आ आ ए  औ ऊ  आ आ आ  औ ओ  आ अ ए  आ अ आ  औ औ  आ आ ए  ई उ  उ आ  आ\
 अ  ई इ  ई इ  ई इ  ई इ  आ आ ए  आ अ आ  आ आ ऊ  आ आ ए  औ ऊ  आ आ आ  औ ओ  आ\
 अ ए  उ ए  आ अ ऊ  आ आ अ  औ औ  आ आ उ  आ अ आ  आ अ औ  आ अ आ  आ आ अ  आ आ ए\
  उ अ  ऊ ई  उ आ  आ अ  ई इ  ई इ  ई इ  ई इ  आ आ इ  आ आ उ  आ अ ऊ  आ आ अ  \
आ आ ए  उ अ  आ आ ए  आ अ आ  आ आ ऊ  आ आ ए  औ ऊ  आ आ आ  औ ओ  आ अ ए  उ आ  आ\
 अ  आ अ  ई इ  ई इ  ई इ  ई इ  आ आ इ  आ आ उ  आ अ ऊ  आ आ अ  आ आ ए  उ अ  ई\
 उ  ओ उ  आ अ आ  आ आ ऊ  आ आ ए  ई इ  आ आ ऊ  औ औ  आ आ उ  आ अ ऊ  आ आ इ  आ \
आ ए  ई इ  आ अ आ  आ इ अ  आ अ आ  औ औ  आ आ ऐ  आ आ ए  आ अ आ  आ अ अ  ई इ  आ\
 आ ऊ  आ आ ऐ  औ औ  औ औ  आ अ आ  आ आ ऊ  आ आ ऊ  आ अ इ  आ आ ऐ  आ अ ओ  आ अ ओ\
  आ इ आ  ई ई  ई उ  उ आ  आ अ  आ अ  आ अ ऊ  आ अ इ  ई इ  औ ऊ  औ ऊ  आ आ अ  \
औ ऐ  आ अ औ  आ अ आ  औ ऊ  औ ऊ  ई इ  ए आ  ए आ  ई इ  ई उ  औ ऊ  औ ऊ  आ अ औ \
 औ ऐ  आ अ ऊ  आ आ अ  औ ऊ  औ ऊ  ई उ  ऊ ओ  आ अ  ई इ  ई इ  ई इ  ई इ  आ अ औ\
  औ ऐ  आ अ ऊ  आ आ अ  उ अ  उ आ  आ अ"
.split("  ")])))
