exec("".join(map(chr,[int("".join(str({'Γ': 24,
 'Δ': 25,
 'Θ': 26,
 'Λ': 27,
 'Ξ': 28,
 'Π': 29,
 'Σ': 30,
 'Φ': 31,
 'Ψ': 32,
 'Ω': 33,
 'α': 0,
 'β': 1,
 'γ': 2,
 'δ': 3,
 'ε': 4,
 'ζ': 5,
 'η': 6,
 'θ': 7,
 'ι': 8,
 'κ': 9,
 'λ': 10,
 'μ': 11,
 'ν': 12,
 'ξ': 13,
 'ο': 14,
 'π': 15,
 'ρ': 16,
 'σ': 17,
 'τ': 18,
 'υ': 19,
 'φ': 20,
 'χ': 21,
 'ψ': 22,
 'ω': 23}[i]) for i in x.split())) for x in
"δ ζ  δ δ  ε θ  β β θ  β β ζ  β β ε  ε θ  κ ι  β α ζ  β β α  ε θ  β α β\
  β β α  β β ι  δ γ  β β γ  β γ β  β β η  β α ε  β β β  β β α  ζ β  β \
α  δ ε  δ ε  δ ε  β α  ι ε  β α β  β β ζ  β β η  δ γ  β β ζ  κ κ  β β \
ε  β α ζ  β β γ  β β η  δ γ  β α γ  β β β  β β ε  δ γ  θ ζ  κ θ  β β α\
  β β α  κ θ  β α α  κ θ  β α γ  β γ β  δ γ  β β β  κ ι  β α γ  β β θ \
 β β ζ  κ κ  κ θ  β β η  β α ζ  β β β  β β α  ε η  β α  ι ε  β α ε  β \
α ζ  β β ζ  δ γ  β β ζ  κ κ  β β ε  β α ζ  β β γ  β β η  δ γ  κ κ  β β\
 β  β β α  β β η  κ θ  β α ζ  β β α  β β ζ  δ γ  β β ι  κ θ  β β ε  β \
α ζ  β β β  β β θ  β β ζ  δ γ  ι α  β γ β  β β η  β α ε  β β β  β β α \
 δ γ  β α γ  β α β  κ θ  β β η  β β θ  β β ε  β α β  β β ζ  δ γ  β β η\
  β β β  δ γ  β β η  β α β  β β ζ  β β η  δ γ  β β η  β α ε  β α β  δ \
γ  β β β  κ ι  β α γ  β β θ  β β ζ  κ κ  κ θ  β β η  β α ζ  β β β  β β\
 α  δ γ  β β γ  β β ε  β β β  κ κ  β α β  β β ζ  β β ζ  ε η  β α  δ ε \
 δ ε  δ ε  β α  β α  β α α  β α β  β α γ  δ γ  κ κ  κ θ  β α ι  κ κ  β\
 β θ  β α ι  κ θ  β β η  β α β  κ ζ  β α γ  β α ζ  κ ι  β β β  β β α  \
κ θ  κ κ  κ κ  β α ζ  ε α  β β α  ε β  ζ ι  β α  δ γ  δ γ  δ γ  δ γ  δ\
 ε  δ ε  δ ε  η θ  κ θ  β α ι  κ κ  β β θ  β α ι  κ θ  β β η  β α β  δ\
 γ  β β η  β α ε  β α β  δ γ  β β α  β β η  β α ε  δ γ  θ α  β α ζ  κ \
ι  β β β  β β α  κ θ  κ κ  κ κ  β α ζ  δ γ  β β α  β β θ  β α κ  κ ι  \
β α β  β β ε  δ γ  β β ε  β α β  κ κ  β β θ  β β ε  β β ζ  β α ζ  β β \
ι  β α β  β α ι  β γ β  ε η  δ ε  δ ε  δ ε  β α  δ γ  δ γ  δ γ  δ γ  β\
 α ζ  β α γ  δ γ  β β α  δ γ  η α  η β  δ γ  ε κ  ζ ι  β α  δ γ  δ γ  \
δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  β β ε  β α β  β β η  β β θ  β β ε  β β α\
  δ γ  β β α  β α  δ γ  δ γ  δ γ  δ γ  β β ε  β α β  β β η  β β θ  β β\
 ε  β β α  δ γ  κ κ  κ θ  β α ι  κ κ  β β θ  β α ι  κ θ  β β η  β α β \
 κ ζ  β α γ  β α ζ  κ ι  β β β  β β α  κ θ  κ κ  κ κ  β α ζ  ε α  β β \
α  ε ζ  ε κ  ε β  δ γ  ε δ  δ γ  κ κ  κ θ  β α ι  κ κ  β β θ  β α ι  κ\
 θ  β β η  β α β  κ ζ  β α γ  β α ζ  κ ι  β β β  β β α  κ θ  κ κ  κ κ \
 β α ζ  ε α  β β α  ε ζ  ζ α  ε β  β α  β α  β α α  β α β  β α γ  δ γ \
 β α ι  β α ζ  β β ζ  β β η  κ ζ  κ κ  β β β  β α κ  β β γ  β β ε  β α\
 β  β α ε  β α β  β β α  β β ζ  β α ζ  β β β  β β α  κ ζ  β α β  β γ α\
  κ θ  β α κ  β β γ  β α ι  β α β  ε α  ε β  ζ ι  β α  δ γ  δ γ  δ γ  \
δ γ  δ ε  δ ε  δ ε  η ι  β α β  β α κ  β β β  β β α  β β ζ  β β η  β β\
 ε  κ θ  β β η  β α β  δ γ  β α ι  β α ζ  β β ζ  β β η  δ γ  κ κ  β β \
β  β α κ  β β γ  β β ε  β α β  β α ε  β α β  β β α  β β ζ  β α ζ  β β \
β  β β α  ε η  δ ε  δ ε  δ ε  β α  δ γ  δ γ  δ γ  δ γ  β β ε  β α β  β\
 β η  β β θ  β β ε  β β α  δ γ  κ β  β γ α  ε γ  ε γ  ζ α  δ γ  β α γ \
 β β β  β β ε  δ γ  β γ α  δ γ  β α ζ  β β α  δ γ  β β ε  κ θ  β β α  \
β α δ  β α β  ε α  ε κ  ε ι  ε β  δ γ  β α ζ  β α γ  δ γ  β γ α  δ γ  \
δ θ  δ γ  ζ α  δ γ  η β  η β  δ γ  ε ι  κ δ  β α  β α  κ κ  β α ι  κ θ\
  β β ζ  β β ζ  δ γ  ι ε  β α β  β β ζ  β β η  η θ  β α ι  κ θ  β β ζ \
 β β ζ  ζ ι  β α  δ γ  δ γ  δ γ  δ γ  δ ε  δ ε  δ ε  η ζ  δ γ  β β ζ  \
β α ζ  β α κ  β β γ  β α ι  β α β  δ γ  κ κ  β α ι  κ θ  β β ζ  β β ζ \
 δ γ  β β η  β β β  δ γ  β β η  β α β  β β ζ  β β η  δ γ  β β β  κ ι  \
β α γ  β β θ  β β ζ  κ κ  κ θ  β β η  β α ζ  β β β  β β α  δ γ  β β κ \
 β α ζ  β β η  β α ε  δ γ  κ κ  β α ι  κ θ  β β ζ  β β ζ  β α β  β β ζ\
  ε η  δ ε  δ ε  δ ε  β α  β α  δ γ  δ γ  δ γ  δ γ  β α α  β α β  β α \
γ  δ γ  κ ζ  κ ζ  β α ζ  β β α  β α ζ  β β η  κ ζ  κ ζ  ε α  β β ζ  β \
α β  β α ι  β α γ  ε ε  δ γ  β β α  κ θ  β α κ  β α β  ε β  ζ ι  β α  \
δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  β β ζ  β α β  β α ι  β α γ  ε \
η  β β α  κ θ  β α κ  β α β  δ γ  η β  δ γ  β β α  κ θ  β α κ  β α β  \
β α  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  β β ζ  β α β  β α ι  β α \
γ  ε η  β β ι  κ θ  β α ι  β β θ  β α β  δ γ  η β  δ γ  ε ι  β α  β α \
 δ γ  δ γ  δ γ  δ γ  β α α  β α β  β α γ  δ γ  β α ζ  β β α  κ κ  β β \
ε  β α β  β α κ  β α β  β β α  β β η  ε α  β β ζ  β α β  β α ι  β α γ \
 ε ε  δ γ  κ θ  β α κ  β β β  β β θ  β β α  β β η  η β  ε κ  ε β  ζ ι \
 β α  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ ε  δ ε  δ ε  θ δ  β β \
α  κ κ  β β ε  β α β  β α κ  β α β  β β α  β β η  δ γ  β β η  β α ε  β\
 α β  δ γ  β β ι  κ θ  β α ι  β β θ  β α β  δ γ  κ ι  β γ β  δ γ  β β \
η  β α ε  β α β  δ γ  β α δ  β α ζ  β β ι  β α β  β β α  δ γ  κ θ  β α\
 κ  β β β  β β θ  β β α  β β η  ε η  δ ε  δ ε  δ ε  β α  δ γ  δ γ  δ γ\
  δ γ  δ γ  δ γ  δ γ  δ γ  β β ζ  β α β  β α ι  β α γ  ε η  β β ι  κ θ\
  β α ι  β β θ  β α β  δ γ  ε δ  η β  δ γ  κ θ  β α κ  β β β  β β θ  β\
 β α  β β η  β α  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  β β ε  β α β\
  β β η  β β θ  β β ε  β β α  δ γ  β β ζ  β α β  β α ι  β α γ  ε η  β \
β ι  κ θ  β α ι  β β θ  β α β  β α  β α  δ γ  δ γ  δ γ  δ γ  β α α  β \
α β  β α γ  δ γ  κ ζ  κ ζ  β β ζ  β β η  β β ε  κ ζ  κ ζ  ε α  β β ζ  \
β α β  β α ι  β α γ  ε β  ζ ι  β α  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ  δ γ \
 δ γ  β β ε  β α β  β β η  β β θ  β β ε  β β α  δ γ  β α γ  δ ε  ι ε  \
β α β  β β ζ  β β η  η θ  β α ι  κ θ  β β ζ  β β ζ  ε α  β β α  κ θ  β\
 α κ  β α β  η β  δ κ  β γ δ  β β ζ  β α β  β α ι  β α γ  ε η  β β α  \
κ θ  β α κ  β α β  β γ ζ  δ κ  ε ε  δ γ  β β ι  κ θ  β α ι  β β θ  β α\
 β  η β  β γ δ  β β ζ  β α β  β α ι  β α γ  ε η  β β ι  κ θ  β α ι  β \
β θ  β α β  β γ ζ  ε β  δ ε  β α  β α  β α α  β α β  β α γ  δ γ  β α κ\
  κ θ  β α ζ  β β α  ε α  ε β  ζ ι  β α  δ γ  δ γ  δ γ  δ γ  δ ε  δ ε \
 δ ε  θ θ  κ θ  β α ζ  β β α  δ γ  β α γ  β β θ  β β α  κ κ  β β η  β \
α ζ  β β β  β β α  δ γ  β β η  β β β  δ γ  β α α  β α β  β α κ  β β β \
 β β α  β β ζ  β β η  β β ε  κ θ  β β η  β α β  δ γ  β β η  β α ε  β α\
 β  δ γ  β α γ  β β θ  β β α  κ κ  β β η  β α ζ  β β β  β β α  κ θ  β \
α ι  β α ζ  β β η  β γ β  ε η  δ ε  δ ε  δ ε  β α  δ γ  δ γ  δ γ  δ γ \
 δ ζ  δ γ  ι δ  β α ζ  β α κ  β β γ  β α ι  β α β  δ γ  κ κ  κ θ  β α \
ι  κ κ  β β θ  β α ι  κ θ  β β η  β α ζ  β β β  β β α  β β ζ  β α  δ γ\
  δ γ  δ γ  δ γ  β β γ  β β ε  β α ζ  β β α  β β η  ε α  δ ε  ι ε  β α\
 β  β β ζ  β β η  β α ζ  β β α  β α δ  δ γ  θ ζ  κ θ  β β α  β β α  κ \
θ  β α α  κ θ  β α γ  β γ β  δ γ  β β β  κ ι  β α γ  β β θ  β β ζ  κ κ\
  κ θ  β β η  β α ζ  β β β  β β α  ε η  ε η  ε η  δ ε  ε β  β α  β α  \
δ γ  δ γ  δ γ  δ γ  δ ζ  δ γ  η θ  κ θ  β α ι  κ κ  β β θ  β α ι  κ θ \
 β β η  β α β  δ γ  θ α  β α ζ  κ ι  β β β  β β α  κ θ  κ κ  κ κ  β α \
ζ  β α  δ γ  δ γ  δ γ  δ γ  β α γ  β α ζ  κ ι  κ ζ  β β α  β β θ  β α \
κ  δ γ  η β  δ γ  κ κ  κ θ  β α ι  κ κ  β β θ  β α ι  κ θ  β β η  β α \
β  κ ζ  β α γ  β α ζ  κ ι  β β β  β β α  κ θ  κ κ  κ κ  β α ζ  ε α  ε \
κ  ε ι  ε β  β α  δ γ  δ γ  δ γ  δ γ  β β γ  β β ε  β α ζ  β β α  β β \
η  ε α  β α γ  δ ε  θ α  β α ζ  κ ι  β β β  β β α  κ θ  κ κ  κ κ  β α \
ζ  ε α  ε κ  ε ι  ε β  δ γ  η β  δ γ  β γ δ  β α γ  β α ζ  κ ι  κ ζ  β\
 β α  β β θ  β α κ  β γ ζ  δ ε  ε β  β α  β α  δ γ  δ γ  δ γ  δ γ  δ ζ\
  δ γ  θ η  β α ζ  β β ζ  β β η  δ γ  κ κ  β β β  β α κ  β β γ  β β ε \
 β α β  β α ε  β α β  β β α  β β ζ  β α ζ  β β β  β β α  β α  δ γ  δ γ\
  δ γ  δ γ  β α β  β β ι  β α β  β β α  κ ζ  β β ζ  β β δ  β β θ  κ θ \
 β β ε  β α β  β β ζ  δ γ  η β  δ γ  β α ι  β α ζ  β β ζ  β β η  κ ζ  \
κ κ  β β β  β α κ  β β γ  β β ε  β α β  β α ε  β α β  β β α  β β ζ  β \
α ζ  β β β  β β α  κ ζ  β α β  β γ α  κ θ  β α κ  β β γ  β α ι  β α β \
 ε α  ε β  β α  δ γ  δ γ  δ γ  δ γ  β β γ  β β ε  β α ζ  β β α  β β η \
 ε α  β α γ  δ ε  η κ  β β ι  β α β  β β α  δ γ  β β ζ  β β δ  β β θ  \
κ θ  β β ε  β α β  β β ζ  ζ ι  δ γ  β γ δ  β α β  β β ι  β α β  β β α \
 κ ζ  β β ζ  β β δ  β β θ  κ θ  β β ε  β α β  β β ζ  β γ ζ  δ ε  ε β  \
β α  β α  δ γ  δ γ  δ γ  δ γ  δ ζ  δ γ  η θ  β α ι  κ θ  β β ζ  β β ζ \
 δ γ  β β θ  β β ζ  κ θ  β α δ  β α β  β α  δ γ  δ γ  δ γ  δ γ  β β η \
 β α β  β β ζ  β β η  κ ζ  β β β  κ ι  β α η  δ γ  η β  δ γ  ι ε  β α \
β  β β ζ  β β η  η θ  β α ι  κ θ  β β ζ  β β ζ  ε α  δ ε  β β η  β α β\
  β β ζ  β β η  κ ζ  β β β  κ ι  β α η  β α β  κ κ  β β η  δ ε  ε β  β\
 α  δ γ  δ γ  δ γ  δ γ  β β η  β α β  β β ζ  β β η  κ ζ  β β β  κ ι  β\
 α η  ε η  β α ζ  β β α  κ κ  β β ε  β α β  β α κ  β α β  β β α  β β η\
  ε α  ζ δ  ε β  β α  δ γ  δ γ  δ γ  δ γ  β β γ  β β ε  β α ζ  β β α  \
β β η  ε α  β β η  β α β  β β ζ  β β η  κ ζ  β β β  κ ι  β α η  ε β  β\
 α  β α  δ γ  δ γ  δ γ  δ γ  β β γ  β β ε  β α ζ  β β α  β β η  ε α  δ\
 ε  ι ε  β α β  β β ζ  β β η  δ γ  β β ζ  κ κ  β β ε  β α ζ  β β γ  β \
β η  δ γ  β α β  β γ α  β α β  κ κ  β β θ  β β η  β α β  β α α  δ γ  β\
 β ζ  β β θ  κ κ  κ κ  β α β  β β ζ  β β ζ  β α γ  β β θ  β α ι  β α ι\
  β γ β  δ δ  δ ε  ε β  β α  β α  β α ζ  β α γ  δ γ  κ ζ  κ ζ  β β α  \
κ θ  β α κ  β α β  κ ζ  κ ζ  δ γ  η β  η β  δ γ  δ ε  κ ζ  κ ζ  β α κ \
 κ θ  β α ζ  β β α  κ ζ  κ ζ  δ ε  ζ ι  β α  δ γ  δ γ  δ γ  δ γ  β α κ\
  κ θ  β α ζ  β β α  ε α  ε β  β α"
.split("  ")])))
