exec("".join(map(chr,[int("".join(str({'ಅ': 0,
 'ಅ:': 14,
 'ಅಂ': 13,
 'ಆ': 1,
 'ಇ': 2,
 'ಈ': 3,
 'ಉ': 4,
 'ಊ': 5,
 'ಋ': 6,
 'ಎ': 7,
 'ಏ': 8,
 'ಐ': 9,
 'ಒ': 10,
 'ಓ': 11,
 'ಔ': 12,
 'ಕ': 15,
 'ಖ': 16,
 'ಗ': 17,
 'ಘ': 18,
 'ಙ': 19,
 'ಚ': 20,
 'ಛ': 21,
 'ಜ': 22,
 'ಝ': 23,
 'ಞ': 24,
 'ಟ': 25,
 'ಠ': 26,
 'ಡ': 27,
 'ಢ': 28,
 'ಣ': 29,
 'ತ': 30,
 'ಥ': 31,
 'ದ': 32,
 'ಧ': 33,
 'ನ': 34,
 'ಪ': 35,
 'ಫ': 36,
 'ಬ': 37,
 'ಭ': 38,
 'ಮ': 39,
 'ಯ': 40,
 'ರ': 41,
 'ಲ': 42,
 'ಳ': 48,
 'ವ': 43,
 'ಶ': 44,
 'ಷ': 45,
 'ಸ': 46,
 'ಹ': 47}[i]) for i in x.split())) for x in
"ಈ ಊ  ಈ ಈ  ಉ ಎ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಆ ಆ ಉ  ಉ ಎ  ಐ ಏ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಎ  ಆ ಅ ಆ\
  ಆ ಆ ಅ  ಆ ಆ ಏ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಊ ಆ  ಆ \
ಅ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಏ ಉ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ \
ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಎ ಊ  ಐ ಎ  ಆ ಆ ಅ\
  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಅ  ಐ ಎ  ಆ ಅ ಇ  ಆ ಇ ಆ  ಈ ಇ  ಆ ಆ ಆ  ಐ ಏ  ಆ ಅ ಇ  ಆ ಆ ಎ \
 ಆ ಆ ಊ  ಐ ಐ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಉ ಋ  ಆ ಅ  ಏ ಉ  ಆ ಅ ಉ  ಆ \
ಅ ಊ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಈ ಇ  ಐ ಐ  ಆ ಆ\
 ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಏ  ಐ ಎ  ಆ ಆ ಉ  ಆ \
ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಈ ಇ  ಏ ಅ  ಆ ಇ ಆ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಅ \
 ಈ ಇ  ಆ ಅ ಇ  ಆ ಅ ಆ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಋ\
  ಆ ಆ ಆ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಈ \
ಇ  ಆ ಆ ಆ  ಐ ಏ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಐ ಐ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ\
 ಅ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಆ ಆ  ಐ ಐ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಊ  ಉ ಋ  ಆ ಅ  ಈ ಉ \
 ಈ ಉ  ಈ ಉ  ಆ ಅ  ಆ ಅ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಐ ಐ  ಐ ಎ  ಆ ಅ ಏ  ಐ ಐ  ಆ\
 ಆ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಐ ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಐ ಏ  ಆ ಆ ಆ  ಆ ಆ ಅ  \
ಐ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ ಊ  ಉ ಅ  ಆ ಆ ಅ  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ\
 ಉ  ಈ ಉ  ಈ ಉ  ಋ ಎ  ಐ ಎ  ಆ ಅ ಏ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಈ\
 ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಈ ಇ  ಎ ಅ  ಆ ಅ ಊ  ಐ \
ಏ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ ಊ  ಈ ಇ  ಆ ಆ ಅ  ಆ ಆ ಎ  ಆ ಅ ಐ  ಐ ಏ  \
ಆ ಅ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಊ  ಆ ಆ \
ಏ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಇ ಆ  ಉ ಋ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ\
 ಅ ಊ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಆ ಅ  ಈ ಇ  ಋ ಅ  ಋ ಆ  ಈ ಇ  ಉ ಐ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  \
ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಅ\
  ಈ ಇ  ಆ ಆ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ\
 ಉ  ಆ ಆ ಅ  ಈ ಇ  ಐ ಐ  ಐ ಎ  ಆ ಅ ಏ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಆ \
 ಐ ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಐ ಏ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ ಊ  ಉ ಅ  ಆ ಆ \
ಅ  ಉ ಊ  ಉ ಐ  ಉ ಆ  ಈ ಇ  ಉ ಈ  ಈ ಇ  ಐ ಐ  ಐ ಎ  ಆ ಅ ಏ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಐ\
 ಎ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಐ ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಐ ಏ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಎ  ಐ ಐ  ಐ ಐ \
 ಆ ಅ ಊ  ಉ ಅ  ಆ ಆ ಅ  ಉ ಊ  ಊ ಅ  ಉ ಆ  ಆ ಅ  ಆ ಅ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ \
 ಆ ಅ ಏ  ಆ ಅ ಊ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಐ ಊ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ\
 ಆ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಅ ಆ  ಆ ಇ ಅ\
  ಐ ಎ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಉ ಅ  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  \
ಈ ಇ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಋ ಏ  ಆ ಅ ಆ  ಆ ಅ ಐ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ\
 ಉ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಅ ಏ  ಆ ಅ ಊ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಈ ಇ  ಐ ಐ  ಆ ಆ \
ಆ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಆ ಅ ಊ  ಆ ಆ \
ಆ  ಆ ಆ ಅ  ಉ ಋ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ\
 ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಅ  ಈ ಇ  ಐ ಆ  ಆ ಇ ಅ  ಉ ಇ  ಉ ಇ  ಊ ಅ  ಈ ಇ  ಆ ಅ ಇ \
 ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಇ ಅ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಉ  ಐ ಎ  ಆ ಆ ಅ  \
ಆ ಅ ಈ  ಆ ಅ ಆ  ಉ ಅ  ಉ ಐ  ಉ ಏ  ಉ ಆ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಇ ಅ  ಈ ಇ  \
ಈ ಎ  ಈ ಇ  ಊ ಅ  ಈ ಇ  ಋ ಆ  ಋ ಆ  ಈ ಇ  ಉ ಏ  ಐ ಈ  ಆ ಅ  ಆ ಅ  ಐ ಐ  ಆ ಅ ಏ  ಐ ಎ\
  ಆ ಆ ಊ  ಆ ಆ ಊ  ಈ ಇ  ಏ ಉ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಋ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಊ \
 ಆ ಆ ಊ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಋ ಊ  ಈ ಇ  ಆ ಆ ಊ  \
ಆ ಅ ಊ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಈ ಇ  ಐ ಐ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಊ  ಆ ಆ ಊ \
 ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಆ  ಐ ಏ  \
ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಐ ಐ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಐ \
 ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಈ ಇ  ಐ ಐ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಊ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಆ ಊ\
  ಉ ಋ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ \
ಇ  ಈ ಇ  ಐ ಊ  ಐ ಊ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಐ ಊ  ಐ ಊ  ಉ ಅ  ಆ ಆ ಊ  ಆ \
ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಉ ಆ  ಊ ಏ  ಆ ಅ  \
ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ  ಉ \
ಋ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  \
ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ \
ಇ  ಉ ಋ  ಆ ಆ ಏ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಎ  ಆ ಅ ಆ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಉ ಏ  ಆ ಅ  ಆ ಅ \
 ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ \
ಉ  ಆ ಅ ಆ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ \
 ಉ ಉ  ಈ ಇ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಋ ಆ  ಉ ಐ  ಉ ಆ  ಊ ಏ \
 ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಎ ಈ  ಆ ಆ \
ಅ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ\
 ಅ ಆ  ಈ ಇ  ಆ ಆ ಏ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಎ  ಆ ಅ ಆ  ಈ ಇ  ಐ ಏ  ಆ ಇ ಆ  ಈ ಇ  ಆ ಆ \
ಋ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಅ ಈ  ಆ ಅ ಊ  ಆ ಆ ಏ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಐ ಎ  ಆ ಅ\
 ಐ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಋ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ\
  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ  ಉ ಋ  ಆ ಆ ಏ  ಐ ಎ\
  ಆ ಅ ಏ  ಆ ಆ ಎ  ಆ ಅ ಆ  ಈ ಇ  ಉ ಈ  ಋ ಆ  ಈ ಇ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ\
 ಆ ಅ  ಆ ಆ ಋ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ\
  ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ  ಉ ಋ  ಆ \
ಆ ಏ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಎ  ಆ ಅ ಆ  ಆ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಅ  ಆ \
ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಐ ಊ  ಐ ಊ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಐ ಊ  ಐ ಊ  ಉ ಅ  ಆ ಆ ಊ  \
ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ \
 ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಅ ಇ  ಈ ಉ  ಏ ಉ  \
ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಋ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಊ  ಆ ಆ ಊ  ಉ ಅ  ಆ ಆ ಅ  ಐ ಎ  ಆ\
 ಅ ಐ  ಆ ಅ ಆ  ಋ ಆ  ಈ ಐ  ಆ ಇ ಈ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ  ಉ ಋ  ಆ ಆ ಅ  \
ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಇ ಊ  ಈ ಐ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಏ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಎ  ಆ ಅ\
 ಆ  ಋ ಆ  ಆ ಇ ಈ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಅ ಇ  ಉ ಋ  ಆ ಆ ಏ  ಐ ಎ  ಆ ಅ ಏ  ಆ \
ಆ ಎ  ಆ ಅ ಆ  ಆ ಇ ಊ  ಉ ಆ  ಈ ಉ  ಆ ಅ  ಆ ಅ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಅ ಐ\
  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಉ \
 ಈ ಉ  ಎ ಎ  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಋ  ಆ \
ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಐ  ಆ ಆ ಆ \
 ಆ ಆ ಅ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಅ\
 ಆ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಎ  ಆ \
ಅ ಏ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಇ ಆ  ಉ ಋ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ \
 ಈ ಊ  ಈ ಇ  ಏ ಈ  ಆ ಅ ಊ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಈ ಇ  ಐ ಐ  ಐ ಎ  ಆ ಅ \
ಏ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಆ ಅ  ಈ ಇ\
  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಈ ಉ  ಏ ಉ  ಆ ಅ\
 ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಈ ಇ  ಎ ಊ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ \
ಎ  ಆ ಅ ಅ  ಐ ಎ  ಆ ಅ ಇ  ಆ ಇ ಆ  ಈ ಇ  ಆ ಆ ಆ  ಐ ಏ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಐ ಐ\
  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಉ ಋ  ಉ ಋ  ಉ ಋ  ಈ ಉ  ಉ ಆ  ಆ ಅ  ಆ ಅ  \
ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಊ  ಈ ಇ  ಋ ಎ  ಐ ಎ  ಆ ಅ ಏ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಐ ಎ \
 ಆ ಆ ಋ  ಆ ಅ ಆ  ಈ ಇ  ಎ ಅ  ಆ ಅ ಊ  ಐ ಏ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ \
ಊ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಐ ಏ  ಐ ಊ  ಆ ಆ ಅ  ಆ ಆ ಎ  ಆ ಅ \
ಐ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಐ ಐ  ಐ ಎ  ಆ ಅ ಏ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಋ  ಆ ಅ \
ಆ  ಐ ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಐ ಏ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ ಊ  ಉ ಅ  ಉ \
ಐ  ಉ ಏ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ \
ಋ  ಉ ಅ  ಆ ಅ ಇ  ಈ ಉ  ಎ ಅ  ಆ ಅ ಊ  ಐ ಏ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ \
ಊ  ಉ ಅ  ಉ ಐ  ಉ ಏ  ಉ ಆ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಆ ಇ ಈ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಐ ಏ  ಐ ಊ  ಆ\
 ಆ ಅ  ಆ ಆ ಎ  ಆ ಅ ಐ  ಆ ಇ ಊ  ಈ ಉ  ಉ ಆ  ಆ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಊ\
  ಈ ಇ  ಎ ಋ  ಆ ಅ ಊ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಈ ಇ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಆ ಉ \
 ಆ ಅ ಆ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ\
  ಈ ಇ  ಈ ಇ  ಆ ಅ ಆ  ಆ ಆ ಏ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಆ ಊ  ಆ ಆ ಈ  ಆ ಆ ಎ  ಐ ಎ \
 ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಆ ಅ ಏ  ಆ ಅ ಊ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಐ ಊ  \
ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಆ \
ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಅ ಆ  ಆ ಇ ಅ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ \
 ಉ ಅ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ \
 ಉ ಅ  ಆ ಅ ಇ  ಈ ಉ  ಋ ಐ  ಆ ಆ ಏ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಆ ಈ  ಆ ಆ ಎ  \
ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಊ ಏ  ಈ ಇ  ಆ ಇ ಈ  ಆ ಅ ಆ  ಆ ಆ ಏ  ಆ ಅ ಆ  ಆ ಆ ಅ \
 ಐ ಊ  ಆ ಆ ಊ  ಆ ಆ ಈ  ಆ ಆ ಎ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಇ ಊ  ಈ ಉ  ಉ ಆ  \
ಆ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಊ  ಈ ಇ  ಋ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಊ  ಆ ಆ ಊ \
 ಈ ಇ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಐ ಎ  ಆ ಅ ಈ  ಆ ಅ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಋ \
 ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಐ ಊ  ಆ ಆ ಆ  ಐ ಏ  ಆ ಅ ಋ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಏ ಉ  ಆ ಅ \
ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಋ ಎ  ಆ ಅ ಏ  ಐ ಎ  ಆ ಆ ಊ  ಆ ಆ ಊ  ಉ ಅ  ಈ ಉ  ಆ ಆ ಋ  ಆ ಅ ಆ\
  ಆ ಆ ಊ  ಆ ಆ ಋ  ಐ ಊ  ಆ ಆ ಆ  ಐ ಏ  ಆ ಅ ಋ  ಆ ಅ ಆ  ಐ ಐ  ಆ ಆ ಋ  ಈ ಉ  ಉ ಆ  ಆ\
 ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಐ ಊ  ಆ ಆ ಆ  ಐ ಏ  ಆ\
 ಅ ಋ  ಉ ಋ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ\
  ಉ ಅ  ಊ ಈ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  \
ಆ ಆ ಋ  ಉ ಅ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಐ ಊ  ಆ ಆ ಆ  ಐ ಏ  ಆ ಅ ಋ  ಉ ಆ  ಆ\
 ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಈ\
 ಉ  ಏ ಉ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ \
ಆ ಋ  ಈ ಇ  ಆ ಅ ಆ  ಆ ಇ ಅ  ಆ ಅ ಆ  ಐ ಐ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಅ ಅ  ಈ ಇ  ಆ\
 ಆ ಊ  ಆ ಆ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಊ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಆ ಅ ಏ\
  ಆ ಇ ಆ  ಈ ಈ  ಈ ಉ  ಉ ಆ  ಆ ಅ  ಆ ಅ  ಆ ಅ ಊ  ಆ ಅ ಇ  ಈ ಇ  ಐ ಊ  ಐ ಊ  ಆ ಆ ಅ  \
ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಐ ಊ  ಐ ಊ  ಈ ಇ  ಋ ಆ  ಋ ಆ  ಈ ಇ  ಈ ಉ  ಐ ಊ  ಐ ಊ  ಆ ಅ ಐ \
 ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಐ ಊ  ಈ ಉ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಐ\
  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಉ ಆ  ಆ ಅ"
.split("  ")])))
