exec("".join(map(chr,[int("".join(str({'அ': 0,
 'ஆ': 1,
 'இ': 2,
 'ஈ': 3,
 'உ': 4,
 'ஊ': 5,
 'எ': 6,
 'ஏ': 7,
 'ஐ': 8,
 'ஒ': 9,
 'ஓ': 10,
 'ஔ': 11,
 'க': 12,
 'ங': 13,
 'ச': 14,
 'ஜ': 30,
 'ஞ': 15,
 'ட': 16,
 'ண': 17,
 'த': 18,
 'ந': 19,
 'ன': 29,
 'ப': 20,
 'ம': 21,
 'ய': 22,
 'ர': 23,
 'ற': 28,
 'ல': 24,
 'ள': 27,
 'ழ': 26,
 'வ': 25,
 'ஷ': 31,
 'ஸ': 32,
 'ஹ': 33}[i]) for i in x.split())) for x in
"ஈ ஊ  ஈ ஈ  உ ஏ  ஆ ஆ ஏ  ஆ ஆ ஊ  ஆ ஆ உ  உ ஏ  ஒ ஐ  ஆ அ ஊ  ஆ ஆ அ  உ ஏ  ஆ அ ஆ\
  ஆ ஆ அ  ஆ ஆ ஐ  ஈ இ  ஆ ஆ இ  ஆ இ ஆ  ஆ ஆ எ  ஆ அ உ  ஆ ஆ ஆ  ஆ ஆ அ  ஊ ஆ  ஆ \
அ  ஈ உ  ஈ உ  ஈ உ  ஆ அ  ஐ உ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஈ இ  ஆ ஆ ஊ  ஒ ஒ  ஆ ஆ \
உ  ஆ அ ஊ  ஆ ஆ இ  ஆ ஆ எ  ஈ இ  ஆ அ இ  ஆ ஆ ஆ  ஆ ஆ உ  ஈ இ  ஏ ஊ  ஒ ஏ  ஆ ஆ அ\
  ஆ ஆ அ  ஒ ஏ  ஆ அ அ  ஒ ஏ  ஆ அ இ  ஆ இ ஆ  ஈ இ  ஆ ஆ ஆ  ஒ ஐ  ஆ அ இ  ஆ ஆ ஏ \
 ஆ ஆ ஊ  ஒ ஒ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  உ எ  ஆ அ  ஐ உ  ஆ அ உ  ஆ \
அ ஊ  ஆ ஆ ஊ  ஈ இ  ஆ ஆ ஊ  ஒ ஒ  ஆ ஆ உ  ஆ அ ஊ  ஆ ஆ இ  ஆ ஆ எ  ஈ இ  ஒ ஒ  ஆ ஆ\
 ஆ  ஆ ஆ அ  ஆ ஆ எ  ஒ ஏ  ஆ அ ஊ  ஆ ஆ அ  ஆ ஆ ஊ  ஈ இ  ஆ ஆ ஐ  ஒ ஏ  ஆ ஆ உ  ஆ \
அ ஊ  ஆ ஆ ஆ  ஆ ஆ ஏ  ஆ ஆ ஊ  ஈ இ  ஐ அ  ஆ இ ஆ  ஆ ஆ எ  ஆ அ உ  ஆ ஆ ஆ  ஆ ஆ அ \
 ஈ இ  ஆ அ இ  ஆ அ ஆ  ஒ ஏ  ஆ ஆ எ  ஆ ஆ ஏ  ஆ ஆ உ  ஆ அ ஆ  ஆ ஆ ஊ  ஈ இ  ஆ ஆ எ\
  ஆ ஆ ஆ  ஈ இ  ஆ ஆ எ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஈ இ  ஆ ஆ எ  ஆ அ உ  ஆ அ ஆ  ஈ \
இ  ஆ ஆ ஆ  ஒ ஐ  ஆ அ இ  ஆ ஆ ஏ  ஆ ஆ ஊ  ஒ ஒ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ\
 அ  ஈ இ  ஆ ஆ இ  ஆ ஆ உ  ஆ ஆ ஆ  ஒ ஒ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ ஊ  உ எ  ஆ அ  ஈ உ \
 ஈ உ  ஈ உ  ஆ அ  ஆ அ  ஆ அ அ  ஆ அ ஆ  ஆ அ இ  ஈ இ  ஒ ஒ  ஒ ஏ  ஆ அ ஐ  ஒ ஒ  ஆ\
 ஆ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஆ  ஒ ஊ  ஆ அ இ  ஆ அ ஊ  ஒ ஐ  ஆ ஆ ஆ  ஆ ஆ அ  \
ஒ ஏ  ஒ ஒ  ஒ ஒ  ஆ அ ஊ  உ அ  ஆ ஆ அ  உ ஆ  ஊ ஐ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ\
 உ  ஈ உ  ஈ உ  எ ஏ  ஒ ஏ  ஆ அ ஐ  ஒ ஒ  ஆ ஆ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஆ  ஈ\
 இ  ஆ ஆ எ  ஆ அ உ  ஆ அ ஆ  ஈ இ  ஆ ஆ அ  ஆ ஆ எ  ஆ அ உ  ஈ இ  ஏ அ  ஆ அ ஊ  ஒ \
ஐ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஏ  ஒ ஒ  ஒ ஒ  ஆ அ ஊ  ஈ இ  ஆ ஆ அ  ஆ ஆ ஏ  ஆ அ ஒ  ஒ ஐ  \
ஆ அ ஆ  ஆ ஆ உ  ஈ இ  ஆ ஆ உ  ஆ அ ஆ  ஒ ஒ  ஆ ஆ ஏ  ஆ ஆ உ  ஆ ஆ ஊ  ஆ அ ஊ  ஆ ஆ \
ஐ  ஆ அ ஆ  ஆ அ ஐ  ஆ இ ஆ  உ எ  ஈ உ  ஈ உ  ஈ உ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ\
 அ ஊ  ஆ அ இ  ஈ இ  ஆ ஆ அ  ஈ இ  எ அ  எ ஆ  ஈ இ  உ ஒ  ஊ ஐ  ஆ அ  ஈ இ  ஈ இ  \
ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ உ  ஆ அ ஆ  ஆ ஆ எ  ஆ ஆ ஏ  ஆ ஆ உ  ஆ ஆ அ\
  ஈ இ  ஆ ஆ அ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ உ  ஆ அ ஆ  ஆ ஆ எ  ஆ ஆ ஏ  ஆ ஆ\
 உ  ஆ ஆ அ  ஈ இ  ஒ ஒ  ஒ ஏ  ஆ அ ஐ  ஒ ஒ  ஆ ஆ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஆ \
 ஒ ஊ  ஆ அ இ  ஆ அ ஊ  ஒ ஐ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஏ  ஒ ஒ  ஒ ஒ  ஆ அ ஊ  உ அ  ஆ ஆ \
அ  உ ஊ  உ ஒ  உ ஆ  ஈ இ  உ ஈ  ஈ இ  ஒ ஒ  ஒ ஏ  ஆ அ ஐ  ஒ ஒ  ஆ ஆ ஏ  ஆ அ ஐ  ஒ\
 ஏ  ஆ ஆ எ  ஆ அ ஆ  ஒ ஊ  ஆ அ இ  ஆ அ ஊ  ஒ ஐ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஏ  ஒ ஒ  ஒ ஒ \
 ஆ அ ஊ  உ அ  ஆ ஆ அ  உ ஊ  ஊ அ  உ ஆ  ஆ அ  ஆ அ  ஆ அ அ  ஆ அ ஆ  ஆ அ இ  ஈ இ \
 ஆ அ ஐ  ஆ அ ஊ  ஆ ஆ ஊ  ஆ ஆ எ  ஒ ஊ  ஒ ஒ  ஆ ஆ ஆ  ஆ அ ஒ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ\
 ஆ  ஆ அ உ  ஆ அ ஆ  ஆ ஆ அ  ஆ ஆ ஊ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஊ  ஆ அ ஆ  ஆ இ அ\
  ஒ ஏ  ஆ அ ஒ  ஆ ஆ இ  ஆ அ ஐ  ஆ அ ஆ  உ அ  உ ஆ  ஊ ஐ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  \
ஈ இ  ஈ உ  ஈ உ  ஈ உ  எ ஐ  ஆ அ ஆ  ஆ அ ஒ  ஆ ஆ ஆ  ஆ ஆ அ  ஆ ஆ ஊ  ஆ ஆ எ  ஆ ஆ\
 உ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஆ  ஈ இ  ஆ அ ஐ  ஆ அ ஊ  ஆ ஆ ஊ  ஆ ஆ எ  ஈ இ  ஒ ஒ  ஆ ஆ \
ஆ  ஆ அ ஒ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ ஆ  ஆ அ உ  ஆ அ ஆ  ஆ ஆ அ  ஆ ஆ ஊ  ஆ அ ஊ  ஆ ஆ \
ஆ  ஆ ஆ அ  உ எ  ஈ உ  ஈ உ  ஈ உ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ உ  ஆ அ ஆ  ஆ\
 ஆ எ  ஆ ஆ ஏ  ஆ ஆ உ  ஆ ஆ அ  ஈ இ  ஒ ஆ  ஆ இ அ  உ இ  உ இ  ஊ அ  ஈ இ  ஆ அ இ \
 ஆ ஆ ஆ  ஆ ஆ உ  ஈ இ  ஆ இ அ  ஈ இ  ஆ அ ஊ  ஆ ஆ அ  ஈ இ  ஆ ஆ உ  ஒ ஏ  ஆ ஆ அ  \
ஆ அ ஈ  ஆ அ ஆ  உ அ  உ ஒ  உ ஐ  உ ஆ  ஈ இ  ஆ அ ஊ  ஆ அ இ  ஈ இ  ஆ இ அ  ஈ இ  \
ஈ ஏ  ஈ இ  ஊ அ  ஈ இ  எ ஆ  எ ஆ  ஈ இ  உ ஐ  ஒ ஈ  ஆ அ  ஆ அ  ஒ ஒ  ஆ அ ஐ  ஒ ஏ\
  ஆ ஆ ஊ  ஆ ஆ ஊ  ஈ இ  ஐ உ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  எ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ ஊ \
 ஆ ஆ ஊ  ஊ ஐ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ உ  ஈ உ  ஈ உ  எ ஊ  ஈ இ  ஆ ஆ ஊ  \
ஆ அ ஊ  ஆ அ ஒ  ஆ ஆ இ  ஆ அ ஐ  ஆ அ ஆ  ஈ இ  ஒ ஒ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ ஊ  ஆ ஆ ஊ \
 ஈ இ  ஆ ஆ எ  ஆ ஆ ஆ  ஈ இ  ஆ ஆ எ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஈ இ  ஆ ஆ ஆ  ஒ ஐ  \
ஆ அ இ  ஆ ஆ ஏ  ஆ ஆ ஊ  ஒ ஒ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  ஈ இ  ஆ ஆ ஒ \
 ஆ அ ஊ  ஆ ஆ எ  ஆ அ உ  ஈ இ  ஒ ஒ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ ஊ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ ஆ ஊ\
  உ எ  ஈ உ  ஈ உ  ஈ உ  ஆ அ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ அ அ  ஆ அ ஆ  ஆ அ \
இ  ஈ இ  ஒ ஊ  ஒ ஊ  ஆ அ ஊ  ஆ ஆ அ  ஆ அ ஊ  ஆ ஆ எ  ஒ ஊ  ஒ ஊ  உ அ  ஆ ஆ ஊ  ஆ \
அ ஆ  ஆ அ ஐ  ஆ அ இ  உ உ  ஈ இ  ஆ ஆ அ  ஒ ஏ  ஆ அ ஒ  ஆ அ ஆ  உ ஆ  ஊ ஐ  ஆ அ  \
ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ அ ஐ  ஆ அ இ  உ \
எ  ஆ ஆ அ  ஒ ஏ  ஆ அ ஒ  ஆ அ ஆ  ஈ இ  எ ஆ  ஈ இ  ஆ ஆ அ  ஒ ஏ  ஆ அ ஒ  ஆ அ ஆ  \
ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ அ ஐ  ஆ அ \
இ  உ எ  ஆ ஆ ஐ  ஒ ஏ  ஆ அ ஐ  ஆ ஆ ஏ  ஆ அ ஆ  ஈ இ  எ ஆ  ஈ இ  உ ஐ  ஆ அ  ஆ அ \
 ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ அ அ  ஆ அ ஆ  ஆ அ இ  ஈ இ  ஆ அ ஊ  ஆ ஆ அ  ஒ ஒ  ஆ ஆ \
உ  ஆ அ ஆ  ஆ அ ஒ  ஆ அ ஆ  ஆ ஆ அ  ஆ ஆ எ  உ அ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ அ ஐ  ஆ அ இ \
 உ உ  ஈ இ  ஒ ஏ  ஆ அ ஒ  ஆ ஆ ஆ  ஆ ஆ ஏ  ஆ ஆ அ  ஆ ஆ எ  எ ஆ  உ ஒ  உ ஆ  ஊ ஐ \
 ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ உ  ஈ உ  ஈ உ  ஏ ஈ  ஆ ஆ \
அ  ஒ ஒ  ஆ ஆ உ  ஆ அ ஆ  ஆ அ ஒ  ஆ அ ஆ  ஆ ஆ அ  ஆ ஆ எ  ஈ இ  ஆ ஆ எ  ஆ அ உ  ஆ\
 அ ஆ  ஈ இ  ஆ ஆ ஐ  ஒ ஏ  ஆ அ ஐ  ஆ ஆ ஏ  ஆ அ ஆ  ஈ இ  ஒ ஐ  ஆ இ ஆ  ஈ இ  ஆ ஆ \
எ  ஆ அ உ  ஆ அ ஆ  ஈ இ  ஆ அ ஈ  ஆ அ ஊ  ஆ ஆ ஐ  ஆ அ ஆ  ஆ ஆ அ  ஈ இ  ஒ ஏ  ஆ அ\
 ஒ  ஆ ஆ ஆ  ஆ ஆ ஏ  ஆ ஆ அ  ஆ ஆ எ  உ எ  ஈ உ  ஈ உ  ஈ உ  ஆ அ  ஈ இ  ஈ இ  ஈ இ\
  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ அ ஐ  ஆ அ இ  உ எ  ஆ ஆ ஐ  ஒ ஏ\
  ஆ அ ஐ  ஆ ஆ ஏ  ஆ அ ஆ  ஈ இ  உ ஈ  எ ஆ  ஈ இ  ஒ ஏ  ஆ அ ஒ  ஆ ஆ ஆ  ஆ ஆ ஏ  ஆ\
 ஆ அ  ஆ ஆ எ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ உ  ஆ அ ஆ\
  ஆ ஆ எ  ஆ ஆ ஏ  ஆ ஆ உ  ஆ ஆ அ  ஈ இ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ அ ஐ  ஆ அ இ  உ எ  ஆ \
ஆ ஐ  ஒ ஏ  ஆ அ ஐ  ஆ ஆ ஏ  ஆ அ ஆ  ஆ அ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ அ அ  ஆ \
அ ஆ  ஆ அ இ  ஈ இ  ஒ ஊ  ஒ ஊ  ஆ ஆ ஊ  ஆ ஆ எ  ஆ ஆ உ  ஒ ஊ  ஒ ஊ  உ அ  ஆ ஆ ஊ  \
ஆ அ ஆ  ஆ அ ஐ  ஆ அ இ  உ ஆ  ஊ ஐ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ இ \
 ஈ இ  ஆ ஆ உ  ஆ அ ஆ  ஆ ஆ எ  ஆ ஆ ஏ  ஆ ஆ உ  ஆ ஆ அ  ஈ இ  ஆ அ இ  ஈ உ  ஐ உ  \
ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  எ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ ஊ  ஆ ஆ ஊ  உ அ  ஆ ஆ அ  ஒ ஏ  ஆ\
 அ ஒ  ஆ அ ஆ  எ ஆ  ஈ ஒ  ஆ இ ஈ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ அ ஐ  ஆ அ இ  உ எ  ஆ ஆ அ  \
ஒ ஏ  ஆ அ ஒ  ஆ அ ஆ  ஆ இ ஊ  ஈ ஒ  உ உ  ஈ இ  ஆ ஆ ஐ  ஒ ஏ  ஆ அ ஐ  ஆ ஆ ஏ  ஆ அ\
 ஆ  எ ஆ  ஆ இ ஈ  ஆ ஆ ஊ  ஆ அ ஆ  ஆ அ ஐ  ஆ அ இ  உ எ  ஆ ஆ ஐ  ஒ ஏ  ஆ அ ஐ  ஆ \
ஆ ஏ  ஆ அ ஆ  ஆ இ ஊ  உ ஆ  ஈ உ  ஆ அ  ஆ அ  ஆ அ அ  ஆ அ ஆ  ஆ அ இ  ஈ இ  ஆ அ ஒ\
  ஒ ஏ  ஆ அ ஊ  ஆ ஆ அ  உ அ  உ ஆ  ஊ ஐ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ உ  ஈ உ \
 ஈ உ  ஏ ஏ  ஒ ஏ  ஆ அ ஊ  ஆ ஆ அ  ஈ இ  ஆ அ இ  ஆ ஆ ஏ  ஆ ஆ அ  ஒ ஒ  ஆ ஆ எ  ஆ \
அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  ஈ இ  ஆ ஆ எ  ஆ ஆ ஆ  ஈ இ  ஆ அ அ  ஆ அ ஆ  ஆ அ ஒ  ஆ ஆ ஆ \
 ஆ ஆ அ  ஆ ஆ ஊ  ஆ ஆ எ  ஆ ஆ உ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஆ  ஈ இ  ஆ ஆ எ  ஆ அ உ  ஆ அ\
 ஆ  ஈ இ  ஆ அ இ  ஆ ஆ ஏ  ஆ ஆ அ  ஒ ஒ  ஆ ஆ எ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஏ  ஆ \
அ ஐ  ஆ அ ஊ  ஆ ஆ எ  ஆ இ ஆ  உ எ  ஈ உ  ஈ உ  ஈ உ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ \
 ஈ ஊ  ஈ இ  ஐ ஈ  ஆ அ ஊ  ஆ அ ஒ  ஆ ஆ இ  ஆ அ ஐ  ஆ அ ஆ  ஈ இ  ஒ ஒ  ஒ ஏ  ஆ அ \
ஐ  ஒ ஒ  ஆ ஆ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ எ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  ஆ ஆ ஊ  ஆ அ  ஈ இ\
  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ ஊ  ஆ ஆ அ  ஆ ஆ எ  உ அ  ஈ உ  ஐ உ  ஆ அ\
 ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஆ அ ஊ  ஆ ஆ அ  ஆ அ ஈ  ஈ இ  ஏ ஊ  ஒ ஏ  ஆ ஆ அ  ஆ ஆ அ  ஒ \
ஏ  ஆ அ அ  ஒ ஏ  ஆ அ இ  ஆ இ ஆ  ஈ இ  ஆ ஆ ஆ  ஒ ஐ  ஆ அ இ  ஆ ஆ ஏ  ஆ ஆ ஊ  ஒ ஒ\
  ஒ ஏ  ஆ ஆ எ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  உ எ  உ எ  உ எ  ஈ உ  உ ஆ  ஆ அ  ஆ அ  \
ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ ஊ  ஈ இ  எ ஏ  ஒ ஏ  ஆ அ ஐ  ஒ ஒ  ஆ ஆ ஏ  ஆ அ ஐ  ஒ ஏ \
 ஆ ஆ எ  ஆ அ ஆ  ஈ இ  ஏ அ  ஆ அ ஊ  ஒ ஐ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஏ  ஒ ஒ  ஒ ஒ  ஆ அ \
ஊ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ அ இ  ஆ அ ஊ  ஒ ஐ  ஒ ஊ  ஆ ஆ அ  ஆ ஆ ஏ  ஆ அ \
ஒ  ஈ இ  எ ஆ  ஈ இ  ஒ ஒ  ஒ ஏ  ஆ அ ஐ  ஒ ஒ  ஆ ஆ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ எ  ஆ அ \
ஆ  ஒ ஊ  ஆ அ இ  ஆ அ ஊ  ஒ ஐ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஏ  ஒ ஒ  ஒ ஒ  ஆ அ ஊ  உ அ  உ \
ஒ  உ ஐ  உ ஆ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ ஊ  ஆ ஆ அ  ஆ ஆ \
எ  உ அ  ஆ அ இ  ஈ உ  ஏ அ  ஆ அ ஊ  ஒ ஐ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஏ  ஒ ஒ  ஒ ஒ  ஆ அ \
ஊ  உ அ  உ ஒ  உ ஐ  உ ஆ  ஈ இ  எ ஆ  ஈ இ  ஆ இ ஈ  ஆ அ இ  ஆ அ ஊ  ஒ ஐ  ஒ ஊ  ஆ\
 ஆ அ  ஆ ஆ ஏ  ஆ அ ஒ  ஆ இ ஊ  ஈ உ  உ ஆ  ஆ அ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ ஊ\
  ஈ இ  ஏ எ  ஆ அ ஊ  ஆ ஆ ஊ  ஆ ஆ எ  ஈ இ  ஒ ஒ  ஆ ஆ ஆ  ஆ அ ஒ  ஆ ஆ இ  ஆ ஆ உ \
 ஆ அ ஆ  ஆ அ உ  ஆ அ ஆ  ஆ ஆ அ  ஆ ஆ ஊ  ஆ அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  ஆ அ  ஈ இ  ஈ இ\
  ஈ இ  ஈ இ  ஆ அ ஆ  ஆ ஆ ஐ  ஆ அ ஆ  ஆ ஆ அ  ஒ ஊ  ஆ ஆ ஊ  ஆ ஆ ஈ  ஆ ஆ ஏ  ஒ ஏ \
 ஆ ஆ உ  ஆ அ ஆ  ஆ ஆ ஊ  ஈ இ  எ ஆ  ஈ இ  ஆ அ ஐ  ஆ அ ஊ  ஆ ஆ ஊ  ஆ ஆ எ  ஒ ஊ  \
ஒ ஒ  ஆ ஆ ஆ  ஆ அ ஒ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ ஆ  ஆ அ உ  ஆ அ ஆ  ஆ ஆ அ  ஆ ஆ ஊ  ஆ \
அ ஊ  ஆ ஆ ஆ  ஆ ஆ அ  ஒ ஊ  ஆ அ ஆ  ஆ இ அ  ஒ ஏ  ஆ அ ஒ  ஆ ஆ இ  ஆ அ ஐ  ஆ அ ஆ \
 உ அ  உ ஆ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ ஊ  ஆ ஆ அ  ஆ ஆ எ \
 உ அ  ஆ அ இ  ஈ உ  எ ஒ  ஆ ஆ ஐ  ஆ அ ஆ  ஆ ஆ அ  ஈ இ  ஆ ஆ ஊ  ஆ ஆ ஈ  ஆ ஆ ஏ  \
ஒ ஏ  ஆ ஆ உ  ஆ அ ஆ  ஆ ஆ ஊ  ஊ ஐ  ஈ இ  ஆ இ ஈ  ஆ அ ஆ  ஆ ஆ ஐ  ஆ அ ஆ  ஆ ஆ அ \
 ஒ ஊ  ஆ ஆ ஊ  ஆ ஆ ஈ  ஆ ஆ ஏ  ஒ ஏ  ஆ ஆ உ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ இ ஊ  ஈ உ  உ ஆ  \
ஆ அ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஈ ஊ  ஈ இ  எ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ ஊ  ஆ ஆ ஊ \
 ஈ இ  ஆ ஆ ஏ  ஆ ஆ ஊ  ஒ ஏ  ஆ அ ஈ  ஆ அ ஆ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ எ \
 ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஒ ஊ  ஆ ஆ ஆ  ஒ ஐ  ஆ அ எ  ஈ இ  எ ஆ  ஈ இ  ஐ உ  ஆ அ \
ஆ  ஆ ஆ ஊ  ஆ ஆ எ  எ ஏ  ஆ அ ஐ  ஒ ஏ  ஆ ஆ ஊ  ஆ ஆ ஊ  உ அ  ஈ உ  ஆ ஆ எ  ஆ அ ஆ\
  ஆ ஆ ஊ  ஆ ஆ எ  ஒ ஊ  ஆ ஆ ஆ  ஒ ஐ  ஆ அ எ  ஆ அ ஆ  ஒ ஒ  ஆ ஆ எ  ஈ உ  உ ஆ  ஆ\
 அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ எ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஒ ஊ  ஆ ஆ ஆ  ஒ ஐ  ஆ\
 அ எ  உ எ  ஆ அ ஊ  ஆ ஆ அ  ஒ ஒ  ஆ ஆ உ  ஆ அ ஆ  ஆ அ ஒ  ஆ அ ஆ  ஆ ஆ அ  ஆ ஆ எ\
  உ அ  ஊ ஈ  உ ஆ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ ஊ  ஆ ஆ அ  \
ஆ ஆ எ  உ அ  ஆ ஆ எ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஒ ஊ  ஆ ஆ ஆ  ஒ ஐ  ஆ அ எ  உ ஆ  ஆ\
 அ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ ஆ இ  ஆ ஆ உ  ஆ அ ஊ  ஆ ஆ அ  ஆ ஆ எ  உ அ  ஈ\
 உ  ஐ உ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ எ  ஈ இ  ஆ ஆ ஊ  ஒ ஒ  ஆ ஆ உ  ஆ அ ஊ  ஆ ஆ இ  ஆ \
ஆ எ  ஈ இ  ஆ அ ஆ  ஆ இ அ  ஆ அ ஆ  ஒ ஒ  ஆ ஆ ஏ  ஆ ஆ எ  ஆ அ ஆ  ஆ அ அ  ஈ இ  ஆ\
 ஆ ஊ  ஆ ஆ ஏ  ஒ ஒ  ஒ ஒ  ஆ அ ஆ  ஆ ஆ ஊ  ஆ ஆ ஊ  ஆ அ இ  ஆ ஆ ஏ  ஆ அ ஐ  ஆ அ ஐ\
  ஆ இ ஆ  ஈ ஈ  ஈ உ  உ ஆ  ஆ அ  ஆ அ  ஆ அ ஊ  ஆ அ இ  ஈ இ  ஒ ஊ  ஒ ஊ  ஆ ஆ அ  \
ஒ ஏ  ஆ அ ஒ  ஆ அ ஆ  ஒ ஊ  ஒ ஊ  ஈ இ  எ ஆ  எ ஆ  ஈ இ  ஈ உ  ஒ ஊ  ஒ ஊ  ஆ அ ஒ \
 ஒ ஏ  ஆ அ ஊ  ஆ ஆ அ  ஒ ஊ  ஒ ஊ  ஈ உ  ஊ ஐ  ஆ அ  ஈ இ  ஈ இ  ஈ இ  ஈ இ  ஆ அ ஒ\
  ஒ ஏ  ஆ அ ஊ  ஆ ஆ அ  உ அ  உ ஆ  ஆ அ"
.split("  ")])))
