exec("".join(map(chr,[int("".join(str({'అ': 0,
 'ఆ': 1,
 'ఇ': 2,
 'ఈ': 3,
 'ఉ': 4,
 'ఊ': 5,
 'ఋ': 6,
 'ఎ': 7,
 'ఏ': 8,
 'ఐ': 9,
 'ఒ': 10,
 'ఓ': 11,
 'ఔ': 12,
 'క': 13,
 'ఖ': 14,
 'గ': 15,
 'ఘ': 16,
 'ఙ': 17,
 'చ': 18,
 'ఛ': 19,
 'జ': 20,
 'ఝ': 21,
 'ఞ': 22,
 'ట': 23,
 'ఠ': 24,
 'డ': 25,
 'ఢ': 26,
 'ణ': 27,
 'త': 28,
 'థ': 29,
 'ద': 30,
 'ధ': 31,
 'న': 32,
 'ప': 33,
 'ఫ': 34,
 'బ': 35,
 'భ': 36,
 'మ': 37,
 'య': 38,
 'ర': 39,
 'ల': 40,
 'వ': 41,
 'శ': 42,
 'ష': 43,
 'స': 44,
 'హ': 45}[i]) for i in x.split())) for x in
"ఈ ఊ  ఈ ఈ  ఉ ఎ  ఆ ఆ ఎ  ఆ ఆ ఊ  ఆ ఆ ఉ  ఉ ఎ  ఐ ఏ  ఆ అ ఊ  ఆ ఆ అ  ఉ ఎ  ఆ అ ఆ\
  ఆ ఆ అ  ఆ ఆ ఏ  ఈ ఇ  ఆ ఆ ఇ  ఆ ఇ ఆ  ఆ ఆ ఋ  ఆ అ ఉ  ఆ ఆ ఆ  ఆ ఆ అ  ఊ ఆ  ఆ \
అ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఆ అ  ఏ ఉ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఈ ఇ  ఆ ఆ ఊ  ఐ ఐ  ఆ ఆ \
ఉ  ఆ అ ఊ  ఆ ఆ ఇ  ఆ ఆ ఋ  ఈ ఇ  ఆ అ ఇ  ఆ ఆ ఆ  ఆ ఆ ఉ  ఈ ఇ  ఎ ఊ  ఐ ఎ  ఆ ఆ అ\
  ఆ ఆ అ  ఐ ఎ  ఆ అ అ  ఐ ఎ  ఆ అ ఇ  ఆ ఇ ఆ  ఈ ఇ  ఆ ఆ ఆ  ఐ ఏ  ఆ అ ఇ  ఆ ఆ ఎ \
 ఆ ఆ ఊ  ఐ ఐ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఉ ఋ  ఆ అ  ఏ ఉ  ఆ అ ఉ  ఆ \
అ ఊ  ఆ ఆ ఊ  ఈ ఇ  ఆ ఆ ఊ  ఐ ఐ  ఆ ఆ ఉ  ఆ అ ఊ  ఆ ఆ ఇ  ఆ ఆ ఋ  ఈ ఇ  ఐ ఐ  ఆ ఆ\
 ఆ  ఆ ఆ అ  ఆ ఆ ఋ  ఐ ఎ  ఆ అ ఊ  ఆ ఆ అ  ఆ ఆ ఊ  ఈ ఇ  ఆ ఆ ఏ  ఐ ఎ  ఆ ఆ ఉ  ఆ \
అ ఊ  ఆ ఆ ఆ  ఆ ఆ ఎ  ఆ ఆ ఊ  ఈ ఇ  ఏ అ  ఆ ఇ ఆ  ఆ ఆ ఋ  ఆ అ ఉ  ఆ ఆ ఆ  ఆ ఆ అ \
 ఈ ఇ  ఆ అ ఇ  ఆ అ ఆ  ఐ ఎ  ఆ ఆ ఋ  ఆ ఆ ఎ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ ఆ ఊ  ఈ ఇ  ఆ ఆ ఋ\
  ఆ ఆ ఆ  ఈ ఇ  ఆ ఆ ఋ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఈ ఇ  ఆ ఆ ఋ  ఆ అ ఉ  ఆ అ ఆ  ఈ \
ఇ  ఆ ఆ ఆ  ఐ ఏ  ఆ అ ఇ  ఆ ఆ ఎ  ఆ ఆ ఊ  ఐ ఐ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ\
 అ  ఈ ఇ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ ఆ ఆ  ఐ ఐ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఊ  ఉ ఋ  ఆ అ  ఈ ఉ \
 ఈ ఉ  ఈ ఉ  ఆ అ  ఆ అ  ఆ అ అ  ఆ అ ఆ  ఆ అ ఇ  ఈ ఇ  ఐ ఐ  ఐ ఎ  ఆ అ ఏ  ఐ ఐ  ఆ\
 ఆ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఆ  ఐ ఊ  ఆ అ ఇ  ఆ అ ఊ  ఐ ఏ  ఆ ఆ ఆ  ఆ ఆ అ  \
ఐ ఎ  ఐ ఐ  ఐ ఐ  ఆ అ ఊ  ఉ అ  ఆ ఆ అ  ఉ ఆ  ఊ ఏ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ\
 ఉ  ఈ ఉ  ఈ ఉ  ఋ ఎ  ఐ ఎ  ఆ అ ఏ  ఐ ఐ  ఆ ఆ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఆ  ఈ\
 ఇ  ఆ ఆ ఋ  ఆ అ ఉ  ఆ అ ఆ  ఈ ఇ  ఆ ఆ అ  ఆ ఆ ఋ  ఆ అ ఉ  ఈ ఇ  ఎ అ  ఆ అ ఊ  ఐ \
ఏ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఎ  ఐ ఐ  ఐ ఐ  ఆ అ ఊ  ఈ ఇ  ఆ ఆ అ  ఆ ఆ ఎ  ఆ అ ఐ  ఐ ఏ  \
ఆ అ ఆ  ఆ ఆ ఉ  ఈ ఇ  ఆ ఆ ఉ  ఆ అ ఆ  ఐ ఐ  ఆ ఆ ఎ  ఆ ఆ ఉ  ఆ ఆ ఊ  ఆ అ ఊ  ఆ ఆ \
ఏ  ఆ అ ఆ  ఆ అ ఏ  ఆ ఇ ఆ  ఉ ఋ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ\
 అ ఊ  ఆ అ ఇ  ఈ ఇ  ఆ ఆ అ  ఈ ఇ  ఋ అ  ఋ ఆ  ఈ ఇ  ఉ ఐ  ఊ ఏ  ఆ అ  ఈ ఇ  ఈ ఇ  \
ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ ఆ ఋ  ఆ ఆ ఎ  ఆ ఆ ఉ  ఆ ఆ అ\
  ఈ ఇ  ఆ ఆ అ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ ఆ ఋ  ఆ ఆ ఎ  ఆ ఆ\
 ఉ  ఆ ఆ అ  ఈ ఇ  ఐ ఐ  ఐ ఎ  ఆ అ ఏ  ఐ ఐ  ఆ ఆ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఆ \
 ఐ ఊ  ఆ అ ఇ  ఆ అ ఊ  ఐ ఏ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఎ  ఐ ఐ  ఐ ఐ  ఆ అ ఊ  ఉ అ  ఆ ఆ \
అ  ఉ ఊ  ఉ ఐ  ఉ ఆ  ఈ ఇ  ఉ ఈ  ఈ ఇ  ఐ ఐ  ఐ ఎ  ఆ అ ఏ  ఐ ఐ  ఆ ఆ ఎ  ఆ అ ఏ  ఐ\
 ఎ  ఆ ఆ ఋ  ఆ అ ఆ  ఐ ఊ  ఆ అ ఇ  ఆ అ ఊ  ఐ ఏ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఎ  ఐ ఐ  ఐ ఐ \
 ఆ అ ఊ  ఉ అ  ఆ ఆ అ  ఉ ఊ  ఊ అ  ఉ ఆ  ఆ అ  ఆ అ  ఆ అ అ  ఆ అ ఆ  ఆ అ ఇ  ఈ ఇ \
 ఆ అ ఏ  ఆ అ ఊ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఐ ఊ  ఐ ఐ  ఆ ఆ ఆ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ\
 ఆ  ఆ అ ఉ  ఆ అ ఆ  ఆ ఆ అ  ఆ ఆ ఊ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఊ  ఆ అ ఆ  ఆ ఇ అ\
  ఐ ఎ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ అ ఏ  ఆ అ ఆ  ఉ అ  ఉ ఆ  ఊ ఏ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  \
ఈ ఇ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఋ ఏ  ఆ అ ఆ  ఆ అ ఐ  ఆ ఆ ఆ  ఆ ఆ అ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఆ ఆ\
 ఉ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఆ  ఈ ఇ  ఆ అ ఏ  ఆ అ ఊ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఈ ఇ  ఐ ఐ  ఆ ఆ \
ఆ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ అ ఉ  ఆ అ ఆ  ఆ ఆ అ  ఆ ఆ ఊ  ఆ అ ఊ  ఆ ఆ \
ఆ  ఆ ఆ అ  ఉ ఋ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ\
 ఆ ఋ  ఆ ఆ ఎ  ఆ ఆ ఉ  ఆ ఆ అ  ఈ ఇ  ఐ ఆ  ఆ ఇ అ  ఉ ఇ  ఉ ఇ  ఊ అ  ఈ ఇ  ఆ అ ఇ \
 ఆ ఆ ఆ  ఆ ఆ ఉ  ఈ ఇ  ఆ ఇ అ  ఈ ఇ  ఆ అ ఊ  ఆ ఆ అ  ఈ ఇ  ఆ ఆ ఉ  ఐ ఎ  ఆ ఆ అ  \
ఆ అ ఈ  ఆ అ ఆ  ఉ అ  ఉ ఐ  ఉ ఏ  ఉ ఆ  ఈ ఇ  ఆ అ ఊ  ఆ అ ఇ  ఈ ఇ  ఆ ఇ అ  ఈ ఇ  \
ఈ ఎ  ఈ ఇ  ఊ అ  ఈ ఇ  ఋ ఆ  ఋ ఆ  ఈ ఇ  ఉ ఏ  ఐ ఈ  ఆ అ  ఆ అ  ఐ ఐ  ఆ అ ఏ  ఐ ఎ\
  ఆ ఆ ఊ  ఆ ఆ ఊ  ఈ ఇ  ఏ ఉ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఋ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఊ \
 ఆ ఆ ఊ  ఊ ఏ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఋ ఊ  ఈ ఇ  ఆ ఆ ఊ  \
ఆ అ ఊ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ అ ఏ  ఆ అ ఆ  ఈ ఇ  ఐ ఐ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఊ  ఆ ఆ ఊ \
 ఈ ఇ  ఆ ఆ ఋ  ఆ ఆ ఆ  ఈ ఇ  ఆ ఆ ఋ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఈ ఇ  ఆ ఆ ఆ  ఐ ఏ  \
ఆ అ ఇ  ఆ ఆ ఎ  ఆ ఆ ఊ  ఐ ఐ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఈ ఇ  ఆ ఆ ఐ \
 ఆ అ ఊ  ఆ ఆ ఋ  ఆ అ ఉ  ఈ ఇ  ఐ ఐ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఊ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ ఆ ఊ\
  ఉ ఋ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఆ అ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ అ అ  ఆ అ ఆ  ఆ అ \
ఇ  ఈ ఇ  ఐ ఊ  ఐ ఊ  ఆ అ ఊ  ఆ ఆ అ  ఆ అ ఊ  ఆ ఆ ఋ  ఐ ఊ  ఐ ఊ  ఉ అ  ఆ ఆ ఊ  ఆ \
అ ఆ  ఆ అ ఏ  ఆ అ ఇ  ఉ ఉ  ఈ ఇ  ఆ ఆ అ  ఐ ఎ  ఆ అ ఐ  ఆ అ ఆ  ఉ ఆ  ఊ ఏ  ఆ అ  \
ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ అ ఏ  ఆ అ ఇ  ఉ \
ఋ  ఆ ఆ అ  ఐ ఎ  ఆ అ ఐ  ఆ అ ఆ  ఈ ఇ  ఋ ఆ  ఈ ఇ  ఆ ఆ అ  ఐ ఎ  ఆ అ ఐ  ఆ అ ఆ  \
ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ అ ఏ  ఆ అ \
ఇ  ఉ ఋ  ఆ ఆ ఏ  ఐ ఎ  ఆ అ ఏ  ఆ ఆ ఎ  ఆ అ ఆ  ఈ ఇ  ఋ ఆ  ఈ ఇ  ఉ ఏ  ఆ అ  ఆ అ \
 ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ అ అ  ఆ అ ఆ  ఆ అ ఇ  ఈ ఇ  ఆ అ ఊ  ఆ ఆ అ  ఐ ఐ  ఆ ఆ \
ఉ  ఆ అ ఆ  ఆ అ ఐ  ఆ అ ఆ  ఆ ఆ అ  ఆ ఆ ఋ  ఉ అ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ అ ఏ  ఆ అ ఇ \
 ఉ ఉ  ఈ ఇ  ఐ ఎ  ఆ అ ఐ  ఆ ఆ ఆ  ఆ ఆ ఎ  ఆ ఆ అ  ఆ ఆ ఋ  ఋ ఆ  ఉ ఐ  ఉ ఆ  ఊ ఏ \
 ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఎ ఈ  ఆ ఆ \
అ  ఐ ఐ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ అ ఐ  ఆ అ ఆ  ఆ ఆ అ  ఆ ఆ ఋ  ఈ ఇ  ఆ ఆ ఋ  ఆ అ ఉ  ఆ\
 అ ఆ  ఈ ఇ  ఆ ఆ ఏ  ఐ ఎ  ఆ అ ఏ  ఆ ఆ ఎ  ఆ అ ఆ  ఈ ఇ  ఐ ఏ  ఆ ఇ ఆ  ఈ ఇ  ఆ ఆ \
ఋ  ఆ అ ఉ  ఆ అ ఆ  ఈ ఇ  ఆ అ ఈ  ఆ అ ఊ  ఆ ఆ ఏ  ఆ అ ఆ  ఆ ఆ అ  ఈ ఇ  ఐ ఎ  ఆ అ\
 ఐ  ఆ ఆ ఆ  ఆ ఆ ఎ  ఆ ఆ అ  ఆ ఆ ఋ  ఉ ఋ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ\
  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ అ ఏ  ఆ అ ఇ  ఉ ఋ  ఆ ఆ ఏ  ఐ ఎ\
  ఆ అ ఏ  ఆ ఆ ఎ  ఆ అ ఆ  ఈ ఇ  ఉ ఈ  ఋ ఆ  ఈ ఇ  ఐ ఎ  ఆ అ ఐ  ఆ ఆ ఆ  ఆ ఆ ఎ  ఆ\
 ఆ అ  ఆ ఆ ఋ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఉ  ఆ అ ఆ\
  ఆ ఆ ఋ  ఆ ఆ ఎ  ఆ ఆ ఉ  ఆ ఆ అ  ఈ ఇ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ అ ఏ  ఆ అ ఇ  ఉ ఋ  ఆ \
ఆ ఏ  ఐ ఎ  ఆ అ ఏ  ఆ ఆ ఎ  ఆ అ ఆ  ఆ అ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ అ అ  ఆ \
అ ఆ  ఆ అ ఇ  ఈ ఇ  ఐ ఊ  ఐ ఊ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఆ ఆ ఉ  ఐ ఊ  ఐ ఊ  ఉ అ  ఆ ఆ ఊ  \
ఆ అ ఆ  ఆ అ ఏ  ఆ అ ఇ  ఉ ఆ  ఊ ఏ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ \
 ఈ ఇ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ ఆ ఋ  ఆ ఆ ఎ  ఆ ఆ ఉ  ఆ ఆ అ  ఈ ఇ  ఆ అ ఇ  ఈ ఉ  ఏ ఉ  \
ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఋ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఊ  ఆ ఆ ఊ  ఉ అ  ఆ ఆ అ  ఐ ఎ  ఆ\
 అ ఐ  ఆ అ ఆ  ఋ ఆ  ఈ ఐ  ఆ ఇ ఈ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ అ ఏ  ఆ అ ఇ  ఉ ఋ  ఆ ఆ అ  \
ఐ ఎ  ఆ అ ఐ  ఆ అ ఆ  ఆ ఇ ఊ  ఈ ఐ  ఉ ఉ  ఈ ఇ  ఆ ఆ ఏ  ఐ ఎ  ఆ అ ఏ  ఆ ఆ ఎ  ఆ అ\
 ఆ  ఋ ఆ  ఆ ఇ ఈ  ఆ ఆ ఊ  ఆ అ ఆ  ఆ అ ఏ  ఆ అ ఇ  ఉ ఋ  ఆ ఆ ఏ  ఐ ఎ  ఆ అ ఏ  ఆ \
ఆ ఎ  ఆ అ ఆ  ఆ ఇ ఊ  ఉ ఆ  ఈ ఉ  ఆ అ  ఆ అ  ఆ అ అ  ఆ అ ఆ  ఆ అ ఇ  ఈ ఇ  ఆ అ ఐ\
  ఐ ఎ  ఆ అ ఊ  ఆ ఆ అ  ఉ అ  ఉ ఆ  ఊ ఏ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఉ  ఈ ఉ \
 ఈ ఉ  ఎ ఎ  ఐ ఎ  ఆ అ ఊ  ఆ ఆ అ  ఈ ఇ  ఆ అ ఇ  ఆ ఆ ఎ  ఆ ఆ అ  ఐ ఐ  ఆ ఆ ఋ  ఆ \
అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఈ ఇ  ఆ ఆ ఋ  ఆ ఆ ఆ  ఈ ఇ  ఆ అ అ  ఆ అ ఆ  ఆ అ ఐ  ఆ ఆ ఆ \
 ఆ ఆ అ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఆ ఆ ఉ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఆ  ఈ ఇ  ఆ ఆ ఋ  ఆ అ ఉ  ఆ అ\
 ఆ  ఈ ఇ  ఆ అ ఇ  ఆ ఆ ఎ  ఆ ఆ అ  ఐ ఐ  ఆ ఆ ఋ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఎ  ఆ \
అ ఏ  ఆ అ ఊ  ఆ ఆ ఋ  ఆ ఇ ఆ  ఉ ఋ  ఈ ఉ  ఈ ఉ  ఈ ఉ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ \
 ఈ ఊ  ఈ ఇ  ఏ ఈ  ఆ అ ఊ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ అ ఏ  ఆ అ ఆ  ఈ ఇ  ఐ ఐ  ఐ ఎ  ఆ అ \
ఏ  ఐ ఐ  ఆ ఆ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఆ ఆ ఊ  ఆ అ  ఈ ఇ\
  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ ఊ  ఆ ఆ అ  ఆ ఆ ఋ  ఉ అ  ఈ ఉ  ఏ ఉ  ఆ అ\
 ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఆ అ ఊ  ఆ ఆ అ  ఆ అ ఈ  ఈ ఇ  ఎ ఊ  ఐ ఎ  ఆ ఆ అ  ఆ ఆ అ  ఐ \
ఎ  ఆ అ అ  ఐ ఎ  ఆ అ ఇ  ఆ ఇ ఆ  ఈ ఇ  ఆ ఆ ఆ  ఐ ఏ  ఆ అ ఇ  ఆ ఆ ఎ  ఆ ఆ ఊ  ఐ ఐ\
  ఐ ఎ  ఆ ఆ ఋ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఉ ఋ  ఉ ఋ  ఉ ఋ  ఈ ఉ  ఉ ఆ  ఆ అ  ఆ అ  \
ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఊ  ఈ ఇ  ఋ ఎ  ఐ ఎ  ఆ అ ఏ  ఐ ఐ  ఆ ఆ ఎ  ఆ అ ఏ  ఐ ఎ \
 ఆ ఆ ఋ  ఆ అ ఆ  ఈ ఇ  ఎ అ  ఆ అ ఊ  ఐ ఏ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఎ  ఐ ఐ  ఐ ఐ  ఆ అ \
ఊ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ అ ఇ  ఆ అ ఊ  ఐ ఏ  ఐ ఊ  ఆ ఆ అ  ఆ ఆ ఎ  ఆ అ \
ఐ  ఈ ఇ  ఋ ఆ  ఈ ఇ  ఐ ఐ  ఐ ఎ  ఆ అ ఏ  ఐ ఐ  ఆ ఆ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఋ  ఆ అ \
ఆ  ఐ ఊ  ఆ అ ఇ  ఆ అ ఊ  ఐ ఏ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఎ  ఐ ఐ  ఐ ఐ  ఆ అ ఊ  ఉ అ  ఉ \
ఐ  ఉ ఏ  ఉ ఆ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ ఊ  ఆ ఆ అ  ఆ ఆ \
ఋ  ఉ అ  ఆ అ ఇ  ఈ ఉ  ఎ అ  ఆ అ ఊ  ఐ ఏ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఎ  ఐ ఐ  ఐ ఐ  ఆ అ \
ఊ  ఉ అ  ఉ ఐ  ఉ ఏ  ఉ ఆ  ఈ ఇ  ఋ ఆ  ఈ ఇ  ఆ ఇ ఈ  ఆ అ ఇ  ఆ అ ఊ  ఐ ఏ  ఐ ఊ  ఆ\
 ఆ అ  ఆ ఆ ఎ  ఆ అ ఐ  ఆ ఇ ఊ  ఈ ఉ  ఉ ఆ  ఆ అ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఊ\
  ఈ ఇ  ఎ ఋ  ఆ అ ఊ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఈ ఇ  ఐ ఐ  ఆ ఆ ఆ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ ఆ ఉ \
 ఆ అ ఆ  ఆ అ ఉ  ఆ అ ఆ  ఆ ఆ అ  ఆ ఆ ఊ  ఆ అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఆ అ  ఈ ఇ  ఈ ఇ\
  ఈ ఇ  ఈ ఇ  ఆ అ ఆ  ఆ ఆ ఏ  ఆ అ ఆ  ఆ ఆ అ  ఐ ఊ  ఆ ఆ ఊ  ఆ ఆ ఈ  ఆ ఆ ఎ  ఐ ఎ \
 ఆ ఆ ఉ  ఆ అ ఆ  ఆ ఆ ఊ  ఈ ఇ  ఋ ఆ  ఈ ఇ  ఆ అ ఏ  ఆ అ ఊ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఐ ఊ  \
ఐ ఐ  ఆ ఆ ఆ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ అ ఉ  ఆ అ ఆ  ఆ ఆ అ  ఆ ఆ ఊ  ఆ \
అ ఊ  ఆ ఆ ఆ  ఆ ఆ అ  ఐ ఊ  ఆ అ ఆ  ఆ ఇ అ  ఐ ఎ  ఆ అ ఐ  ఆ ఆ ఇ  ఆ అ ఏ  ఆ అ ఆ \
 ఉ అ  ఉ ఆ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ ఊ  ఆ ఆ అ  ఆ ఆ ఋ \
 ఉ అ  ఆ అ ఇ  ఈ ఉ  ఋ ఐ  ఆ ఆ ఏ  ఆ అ ఆ  ఆ ఆ అ  ఈ ఇ  ఆ ఆ ఊ  ఆ ఆ ఈ  ఆ ఆ ఎ  \
ఐ ఎ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ ఆ ఊ  ఊ ఏ  ఈ ఇ  ఆ ఇ ఈ  ఆ అ ఆ  ఆ ఆ ఏ  ఆ అ ఆ  ఆ ఆ అ \
 ఐ ఊ  ఆ ఆ ఊ  ఆ ఆ ఈ  ఆ ఆ ఎ  ఐ ఎ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఇ ఊ  ఈ ఉ  ఉ ఆ  \
ఆ అ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఊ  ఈ ఇ  ఋ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఊ  ఆ ఆ ఊ \
 ఈ ఇ  ఆ ఆ ఎ  ఆ ఆ ఊ  ఐ ఎ  ఆ అ ఈ  ఆ అ ఆ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఋ \
 ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఐ ఊ  ఆ ఆ ఆ  ఐ ఏ  ఆ అ ఋ  ఈ ఇ  ఋ ఆ  ఈ ఇ  ఏ ఉ  ఆ అ \
ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఋ ఎ  ఆ అ ఏ  ఐ ఎ  ఆ ఆ ఊ  ఆ ఆ ఊ  ఉ అ  ఈ ఉ  ఆ ఆ ఋ  ఆ అ ఆ\
  ఆ ఆ ఊ  ఆ ఆ ఋ  ఐ ఊ  ఆ ఆ ఆ  ఐ ఏ  ఆ అ ఋ  ఆ అ ఆ  ఐ ఐ  ఆ ఆ ఋ  ఈ ఉ  ఉ ఆ  ఆ\
 అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఋ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఐ ఊ  ఆ ఆ ఆ  ఐ ఏ  ఆ\
 అ ఋ  ఉ ఋ  ఆ అ ఊ  ఆ ఆ అ  ఐ ఐ  ఆ ఆ ఉ  ఆ అ ఆ  ఆ అ ఐ  ఆ అ ఆ  ఆ ఆ అ  ఆ ఆ ఋ\
  ఉ అ  ఊ ఈ  ఉ ఆ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ ఊ  ఆ ఆ అ  \
ఆ ఆ ఋ  ఉ అ  ఆ ఆ ఋ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఐ ఊ  ఆ ఆ ఆ  ఐ ఏ  ఆ అ ఋ  ఉ ఆ  ఆ\
 అ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ ఆ ఇ  ఆ ఆ ఉ  ఆ అ ఊ  ఆ ఆ అ  ఆ ఆ ఋ  ఉ అ  ఈ\
 ఉ  ఏ ఉ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఋ  ఈ ఇ  ఆ ఆ ఊ  ఐ ఐ  ఆ ఆ ఉ  ఆ అ ఊ  ఆ ఆ ఇ  ఆ \
ఆ ఋ  ఈ ఇ  ఆ అ ఆ  ఆ ఇ అ  ఆ అ ఆ  ఐ ఐ  ఆ ఆ ఎ  ఆ ఆ ఋ  ఆ అ ఆ  ఆ అ అ  ఈ ఇ  ఆ\
 ఆ ఊ  ఆ ఆ ఎ  ఐ ఐ  ఐ ఐ  ఆ అ ఆ  ఆ ఆ ఊ  ఆ ఆ ఊ  ఆ అ ఇ  ఆ ఆ ఎ  ఆ అ ఏ  ఆ అ ఏ\
  ఆ ఇ ఆ  ఈ ఈ  ఈ ఉ  ఉ ఆ  ఆ అ  ఆ అ  ఆ అ ఊ  ఆ అ ఇ  ఈ ఇ  ఐ ఊ  ఐ ఊ  ఆ ఆ అ  \
ఐ ఎ  ఆ అ ఐ  ఆ అ ఆ  ఐ ఊ  ఐ ఊ  ఈ ఇ  ఋ ఆ  ఋ ఆ  ఈ ఇ  ఈ ఉ  ఐ ఊ  ఐ ఊ  ఆ అ ఐ \
 ఐ ఎ  ఆ అ ఊ  ఆ ఆ అ  ఐ ఊ  ఐ ఊ  ఈ ఉ  ఊ ఏ  ఆ అ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఈ ఇ  ఆ అ ఐ\
  ఐ ఎ  ఆ అ ఊ  ఆ ఆ అ  ఉ అ  ఉ ఆ  ఆ అ"
.split("  ")])))
