exec("".join(map(chr,[int("".join(str({'ಅ': 0,
 'ಅಂ': 13,
 'ಅಃಕ': 14,
 'ಆ': 1,
 'ಇ': 2,
 'ಈ': 3,
 'ಉ': 4,
 'ಊ': 5,
 'ಋ': 6,
 'ಎ': 7,
 'ಏ': 8,
 'ಐ': 9,
 'ಒ': 10,
 'ಓ': 11,
 'ಔ': 12,
 'ಖ': 15,
 'ಗ': 16,
 'ಘ': 17,
 'ಙ': 18,
 'ಚ': 19,
 'ಛ': 20,
 'ಜ': 21,
 'ಝ': 22,
 'ಞ': 23,
 'ಟ': 24,
 'ಠ': 25,
 'ಡ': 26,
 'ಢ': 27,
 'ಣ': 28,
 'ತ': 29,
 'ಥದ': 30,
 'ಧ': 31,
 'ನ': 32,
 'ಪ': 33,
 'ಫ': 34,
 'ಬ': 35,
 'ಭ': 36,
 'ಮ': 37,
 'ಯ': 38,
 'ರ': 39,
 'ಲ': 40,
 'ಳ': 46,
 'ವ': 41,
 'ಶ': 42,
 'ಷ': 43,
 'ಸ': 44,
 'ಹ': 45}[i]) for i in x.split())) for x in
"ಈ ಊ  ಈ ಈ  ಉ ಎ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಆ ಆ ಉ  ಉ ಎ  ಐ ಏ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಎ  ಆ ಅ ಆ\
  ಆ ಆ ಅ  ಆ ಆ ಏ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಊ ಆ  ಆ \
ಅ  ಆ ಅ  ಆ ಅ ಊ  ಆ ಅ ಐ  ಆ ಆ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಆ ಋ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ\
 ಈ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಅ  ಆ ಅ ಇ  ಆ ಆ ಉ  ಆ ಆ ಆ  ಆ ಅ ಐ  \
ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಅ ಐ  ಆ ಆ \
ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಅ ಐ  ಐ ಎ  ಆ\
 ಆ ಋ  ಆ ಅ  ಆ ಅ  ಐ ಊ  ಐ ಊ  ಐ ಎ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಐ ಊ \
 ಐ ಊ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಈ ಉ  ಎ ಎ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಎ ಆ \
 ಆ ಆ ಆ  ಆ ಆ ಐ  ಆ ಅ ಅ  ಐ ಎ  ಉ ಋ  ಋ ಋ  ಈ ಉ  ಆ ಅ  ಐ ಊ  ಐ ಊ  ಐ ಐ  ಆ ಆ ಆ  ಆ\
 ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಅ ಈ  ಆ ಅ ಉ  ಆ ಆ ಋ  ಐ ಊ  ಐ ಊ  ಈ ಇ  ಋ ಆ  ಈ \
ಇ  ಈ ಉ  ಋ ಎ  ಆ ಆ ಆ  ಆ ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಅ ಈ  ಆ ಅ ಉ  ಆ ಆ ಋ  ಈ\
 ಇ  ಉ ಅ  ಐ ಐ  ಉ ಆ  ಈ ಇ  ಊ ಅ  ಉ ಏ  ಊ ಅ  ಊ ಇ  ಉ ಉ  ಈ ಇ  ಎ ಎ  ಆ ಅ ಊ  ಆ ಆ \
ಋ  ಆ ಅ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಎ ಆ  ಆ ಆ ಆ  ಆ ಆ ಐ  ಆ ಅ ಅ  ಐ ಎ  ಉ ಋ  ಋ ಋ  ಈ ಉ  \
ಆ ಅ  ಆ ಅ  ಈ ಊ  ಎ ಎ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಋ ಏ  ಆ ಅ ಆ  ಆ ಆ\
 ಏ  ಆ ಅ  ಎ ಊ  ಋ ಊ  ಎ ಏ  ಎ ಏ  ಋ ಊ  ಋ ಏ  ಋ ಊ  ಐ ಊ  ಎ ಋ  ಋ ಐ  ಏ ಉ  ಏ ಉ  ಋ\
 ಐ  ಏ ಇ  ಏ ಈ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಐ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಅ \
ಊ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಅ ಋ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಅ ಎ  ಈ ಉ  ಉ ಉ \
 ಈ ಇ  ಈ ಉ  ಈ ಇ ಅ ಏ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಅ ಐ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ\
 ಇ ಆ ಅ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಆ ಆ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಆ ಉ  ಈ ಉ \
 ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಆ ಊ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಆ ಋ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ\
 ಉ  ಈ ಇ ಆ ಏ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಆ ಐ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಅ \
 ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಅ ಊ  ಈ ಇ ಅ ಇ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಅ ಊ  ಈ \
ಇ ಅ ಈ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಆ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ \
 ಈ ಇ ಇ ಇ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಈ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಉ  ಈ \
ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಊ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಋ  ಈ ಉ  ಉ ಉ  ಈ ಇ \
 ಈ ಉ  ಈ ಇ ಇ ಎ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಏ  ಈ ಉ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ\
 ಇ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಇ ಐ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಅ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ\
  ಈ ಇ ಈ ಆ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಇ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಈ  ಈ\
 ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಉ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಊ  ಈ ಉ  ಉ ಉ  ಈ ಇ\
  ಈ ಉ  ಈ ಇ ಈ ಋ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಎ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  \
ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಏ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಈ ಐ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ \
ಇ ಉ ಅ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಉ ಇ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಉ ಈ  ಈ ಉ  \
ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಉ ಉ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಉ ಊ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ \
ಉ  ಈ ಇ ಉ ಋ  ಈ ಉ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಉ ಎ  ಈ ಉ  ಉ ಉ \
 ಈ ಇ  ಈ ಉ  ಈ ಇ ಉ ಏ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಊ ಅ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ\
 ಇ ಊ ಈ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಊ ಉ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಊ ಊ  ಈ ಉ \
 ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಊ ಋ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಈ ಇ ಊ ಎ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ\
 ಉ  ಈ ಇ ಊ ಆ  ಈ ಉ  ಆ ಅ  ಐ ಈ  ಆ ಅ  ಎ ಎ  ಋ ಊ  ಏ ಏ  ಐ ಊ  ಏ ಈ  ಏ ಉ  ಏ ಇ  ಐ \
ಊ  ಎ ಋ  ಋ ಐ  ಎ ಏ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಊ ಊ  ಉ ಏ  ಆ ಅ  ಆ ಅ  ಆ ಅ  ಆ ಅ ಅ  ಆ ಅ ಆ\
  ಆ ಅ ಇ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಐ ಊ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಇ  ಐ ಎ \
 ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಉ ಅ  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಉ\
  ಈ ಉ  ಏ ಊ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಎ  ಆ ಅ ಐ \
 ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಆ ಆ ಊ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ\
 ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ \
ಈ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಉ ಋ  ಋ ಊ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಎ  ಆ ಅ\
 ಐ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಏ ಅ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಉ ಅ  ಆ \
ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಐ ಐ  ಆ\
 ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಋ ಆ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ \
ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಎ ಐ  ಐ ಏ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಐ ಐ  ಐ ಎ  ಆ ಆ ಋ \
 ಆ ಅ ಆ  ಈ ಇ  ಆ ಇ ಆ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಋ  ಆ ಅ\
 ಉ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಈ ಇ  ಐ \
ಏ  ಆ ಇ ಆ  ಈ ಇ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಆ ಆ ಏ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ\
 ಆ ಅ  ಆ ಅ ಈ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  \
ಈ ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  ಐ\
 ಎ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ  ಈ \
ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಋ  \
ಆ ಅ ಉ  ಐ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ \
 ಆ ಆ ಅ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಆ ಊ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ\
  ಈ ಇ  ಉ ಅ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಇ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಅ ಏ  ಆ ಅ ಏ  ಆ \
ಇ ಆ  ಉ ಆ  ಈ ಇ  ಐ ಏ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಅ\
  ಆ ಅ ಆ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಈ ಇ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಅ  ಆ ಅ \
ಆ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಊ  ಈ ಇ  ಎ ಊ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಅ  ಐ ಎ  ಈ ಇ \
 ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಆ \
ಆ ಊ  ಉ ಋ  ಈ ಇ  ಉ ಊ  ಉ ಊ  ಈ ಇ  ಎ ಎ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  \
ಎ ಆ  ಆ ಆ ಆ  ಆ ಆ ಐ  ಆ ಅ ಅ  ಐ ಎ  ಉ ಋ  ಋ ಋ  ಉ ಋ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ \
 ಈ ಇ  ಈ ಇ  ಈ ಇ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ\
  ಆ ಅ ಆ  ಆ ಆ ಉ  ಉ ಋ  ಐ ಎ  ಆ ಅ ಅ  ಆ ಅ ಅ  ಐ ಊ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಎ \
 ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಈ ಉ  ಉ ಊ  ಆ ಅ ಊ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ \
 ಉ ಊ  ಉ ಊ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಉ  ಆ \
ಅ ಆ  ಆ ಆ ಈ  ಆ ಆ ಎ  ಆ ಅ ಊ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಅ ಅ  ಋ ಆ  ಏ ಉ  ಆ ಆ ಉ  ಆ ಆ ಎ \
 ಆ ಅ ಆ  ಉ ಉ  ಈ ಇ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಋ ಆ  ಈ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  \
ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಈ \
ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ\
 ಆ  ಈ ಉ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ\
  ಆ ಆ ಉ  ಉ ಋ  ಐ ಎ  ಆ ಅ ಅ  ಆ ಅ ಅ  ಐ ಊ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಎ  ಆ ಅ ಐ \
 ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ\
  ಈ ಉ  ಉ ಊ  ಆ ಆ ಆ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಉ ಊ  ಉ ಊ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  \
ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಉ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಈ  ಆ ಆ ಎ  ಆ ಅ ಊ \
 ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಅ ಅ  ಋ ಆ  ಏ ಉ  ಆ ಆ ಉ  ಆ ಆ ಎ  ಆ ಅ ಆ  ಉ ಉ  ಈ ಇ  ಆ ಅ ಉ  \
ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಋ ಆ  ಈ ಉ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ \
ಋ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಊ  ಐ ಐ  ಆ ಆ\
 ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಈ ಉ  ಆ ಅ  ಈ ಇ \
 ಈ ಇ  ಈ ಇ  ಈ ಇ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ\
  ಆ ಅ ಆ  ಆ ಆ ಉ  ಉ ಋ  ಐ ಎ  ಆ ಅ ಅ  ಆ ಅ ಅ  ಐ ಊ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಎ \
 ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ\
 ಇ  ಈ ಇ  ಈ ಉ  ಉ ಊ  ಆ ಅ ಎ  ಈ ಉ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ \
 ಈ ಇ  ಈ ಇ  ಈ ಉ  ಉ ಊ  ಉ ಊ  ಆ ಅ ಎ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಅ  ಐ ಎ  ಈ\
 ಉ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ \
ಆ ಊ  ಆ ಆ ಋ  ಋ ಆ  ಈ ಉ  ಆ ಅ ಎ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಅ  ಐ ಎ  ಈ ಉ  \
ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಐ ಎ  ಐ ಐ  ಆ ಆ ಋ  ಆ ಅ\
 ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಋ ಆ  ಈ ಉ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಐ ಊ  ಆ \
ಆ ಋ  ಆ ಆ ಉ  ಆ ಆ ಎ  ಆ ಅ ಆ  ಈ ಉ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ \
 ಈ ಇ  ಈ ಇ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಋ ಆ  ಈ ಉ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  \
ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಎ ಊ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಅ  ಐ ಎ  ಈ ಇ\
  ಆ ಅ ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  \
ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಐ ಎ  ಆ ಅ ಅ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಅ ಆ  ಆ ಅ ಐ \
 ಆ ಆ ಆ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ\
  ಆ ಅ ಆ  ಆ ಅ ಐ  ಆ ಆ ಆ  ಆ ಅ ಋ  ಆ ಅ ಊ  ಆ ಆ ಊ  ಈ ಉ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ\
 ಇ  ಈ ಇ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ\
  ಆ ಆ ಉ  ಉ ಋ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಐ ಊ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಐ ಎ  ಆ ಆ \
ಎ  ಆ ಅ ಏ  ಆ ಆ ಋ  ಆ ಆ ಊ  ಉ ಅ  ಆ ಅ ಎ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಅ  ಐ ಎ\
  ಋ ಆ  ಎ ಅ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ \
ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ \
 ಆ ಅ ಆ  ಆ ಆ ಉ  ಉ ಋ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಐ ಊ  ಐ ಎ  ಆ ಆ ಉ  \
ಆ ಅ ಈ  ಆ ಆ ಊ  ಉ ಅ  ಉ ಆ  ಆ ಅ  ಆ ಅ  ಆ ಅ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಐ ಐ  \
ಆ ಅ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಆ ಅ ಎ  ಐ ಊ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ \
ಅ ಈ  ಉ ಅ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಆ ಊ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಅ  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ \
ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಋ ಎ  ಆ ಅ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಆ ಅ ಎ  ಈ ಇ \
 ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  ಆ ಅ\
 ಐ  ಐ ಎ  ಆ ಇ ಅ  ಈ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಈ ಇ  ಆ \
ಆ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಆ ಅ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಉ \
 ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಅ  ಈ ಇ  ಈ ಉ  ಐ ಇ  ಆ ಆ ಅ  ಈ ಉ  ಉ ಋ  ಆ \
ಅ ಋ  ಆ ಆ ಆ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ \
 ಈ ಇ  ಈ ಉ  ಆ ಇ ಈ  ಆ ಇ ಊ  ಐ ಇ  ಐ ಇ  ಈ ಉ  ಉ ಋ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಅ \
ಐ  ಐ ಎ  ಆ ಆ ಋ  ಉ ಅ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಆ ಊ  ಐ ಆ  ಆ ಅ ಊ  ಈ ಇ  ಊ ಏ  ಈ \
ಇ  ಆ ಅ ಊ  ಈ ಇ  ಉ ಈ  ಈ ಇ  ಆ ಆ ಅ  ಐ ಈ  ಉ ಆ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ \
ಇ  ಆ ಅ ಊ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಉ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಆ ಅ ಆ  ಉ ಅ\
  ಉ ಏ  ಉ ಉ  ಈ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಆ ಊ  ಉ\
 ಆ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಅ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಉ ಆ  ಉ ಋ  ಆ ಆ ಉ  ಆ \
ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಇ  ಉ ಅ  ಈ ಉ  ಐ ಇ  ಐ ಇ  ಈ ಉ  ಉ ಆ  ಆ ಅ  ಆ \
ಅ  ಆ ಅ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಅ  ಆ ಅ\
 ಆ  ಐ ಊ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಉ ಅ  ಆ ಅ ಊ  ಆ ಆ ಅ  \
ಐ ಊ  ಆ ಆ ಊ  ಉ ಉ  ಈ ಇ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಆ ಅ ಉ  ಐ ಎ  ಐ ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ\
  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಋ ಎ  ಆ ಆ ಆ  ಆ ಆ ಅ \
 ಆ ಆ ಏ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ\
 ಇ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  \
ಆ ಅ ಆ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಅ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ \
ಋ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ \
 ಈ ಇ  ಆ ಆ ಐ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಅ ಈ\
  ಆ ಅ ಊ  ಆ ಆ ಏ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಆ ಅ ಉ  ಐ ಎ  ಐ ಏ \
 ಆ ಅ ಆ  ಆ ಆ ಋ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಊ  ಈ ಇ  ಎ ಏ  \
ಆ ಆ ಆ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಆ \
ಋ  ಆ ಆ ಆ  ಈ ಇ  ಋ ಎ  ಆ ಆ ಇ  ಆ ಇ ಆ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಊ ಆ\
  ಉ ಋ  ಊ ಉ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಆ \
 ಆ ಆ ಉ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಅ ಐ  ಐ ಎ  ಆ ಇ ಆ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಅ ಊ\
  ಆ ಅ ಇ  ಆ ಅ ಇ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಆ ಎ  ಆ \
ಅ ಆ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಊ  ಈ ಇ  ಆ ಅ ಅ  ಆ ಅ \
ಊ  ಐ ಐ  ಆ ಆ ಋ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಅ  ಆ ಆ ಆ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಆ ಆ\
 ಋ  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಊ  \
ಆ ಅ ಆ  ಆ ಆ ಉ  ಆ ಆ ಋ  ಆ ಅ ಊ  ಆ ಆ ಆ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಅ ಅ  ಆ \
ಅ ಆ  ಆ ಆ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಅ  ಉ ಐ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಆ ಅ ಅ \
 ಆ ಅ ಊ  ಐ ಐ  ಆ ಆ ಋ  ಉ ಅ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಐ ಎ\
  ಆ ಆ ಋ  ಆ ಅ ಆ  ಉ ಅ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಆ ಅ ಉ  ಐ ಎ  ಐ ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ \
 ಉ ಆ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಅ  ಊ ಅ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಆ ಇ ಈ  \
ಆ ಆ ಏ  ಊ ಏ  ಈ ಇ  ಆ ಅ ಎ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಅ ಎ  ಉ ಉ  ಈ ಇ\
  ಆ ಆ ಏ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಈ ಇ  ಆ ಅ ಅ  ಉ ಐ  ಉ ಋ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಆ \
 ಆ ಅ ಐ  ಆ ಆ ಊ  ಉ ಅ  ಉ ಆ  ಆ ಇ ಊ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಅ ಆ \
 ಆ ಆ ಋ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಆ ಆ ಅ  ಈ ಇ  ಉ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ\
 ಇ  ಈ ಇ  ಈ ಇ  ಈ ಐ  ಆ ಅ ಆ  ಆ ಇ ಅ  ಆ ಅ ಆ  ಐ ಐ  ಉ ಅ  ಈ ಉ  ಈ ಉ  ಉ ಋ  ಆ ಅ ಋ\
  ಆ ಆ ಆ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಅ ಐ  ಐ ಎ  ಆ ಆ ಇ  ಉ ಅ  ಐ ಐ  ಆ ಅ ಉ  ಆ ಆ ಉ \
 ಉ ಉ  ಐ ಆ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಈ ಉ  ಈ ಉ  ಉ ಋ  ಆ ಅ ಋ  ಆ ಆ ಆ  ಆ ಅ \
ಊ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಉ ಅ  ಆ ಇ ಈ  ಆ ಇ ಊ  ಐ ಆ  ಆ ಅ ಊ  ಐ ಈ\
  ಉ ಆ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಅ ಊ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಈ ಇ  ಆ\
 ಇ ಅ  ಉ ಋ  ಆ ಆ ಊ  ಆ ಆ ಇ  ಆ ಅ ಏ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಉ ಅ  ಉ ಆ  ಉ ಆ  ಉ ಆ  ಈ ಇ \
 ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಇ ಅ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಇ  ಆ ಆ ಅ  ಈ ಐ  \
ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಐ  ಈ ಉ  ಆ ಇ ಈ  ಆ ಇ ಊ  ಈ\
 ಉ  ಐ ಇ  ಆ ಆ ಅ  ಉ ಋ  ಆ ಆ ಊ  ಆ ಆ ಇ  ಆ ಅ ಏ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಉ ಅ  ಈ ಉ  ಈ ಇ \
 ಈ ಇ  ಈ ಉ  ಉ ಆ  ಐ ಈ  ಉ ಆ  ಉ ಆ  ಉ ಆ  ಐ ಇ  ಆ ಆ ಅ  ಈ ಐ  ಉ ಋ  ಆ ಅ ಇ  ಆ ಆ ಆ\
  ಆ ಆ ಉ  ಆ ಅ ಐ  ಐ ಎ  ಆ ಆ ಋ  ಉ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ \
ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಅ ಐ  ಐ ಎ  ಆ \
ಆ ಋ  ಉ ಅ  ಆ ಅ ಅ  ಊ ಅ  ಉ ಆ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ\
  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಐ ಐ  ಆ ಅ ಉ  ಆ ಆ ಎ  ಆ ಆ ಅ  ಆ ಅ ಎ  ಐ ಊ  ಆ ಆ ಊ\
  ಆ ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಉ ಅ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ\
  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಇ  ಈ ಇ\
  ಈ ಉ  ಉ ಋ  ಆ ಅ ಋ  ಆ ಆ ಆ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಈ ಉ  ಈ ಇ  ಈ ಉ  ಉ ಋ  ಆ ಅ ಋ\
  ಆ ಆ ಆ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಅ ಅ  ಉ ಐ  ಐ ಆ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ \
 ಆ ಅ ಊ  ಉ ಆ  ಐ ಈ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಅ ಊ  ಈ ಇ  ಆ ಅ ಊ  ಆ \
ಆ ಅ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಆ ಋ  ಆ ಆ ಉ  ಉ ಅ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಅ ಅ  ಉ ಅ  ಐ ಐ  ಉ ಆ\
  ಉ ಆ  ಉ ಆ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಈ ಇ  ಐ ಐ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಈ ಇ\
  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಆ ಊ  ಉ ಆ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ \
ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಎ ಎ  ಋ ಊ  ಏ ಏ  ಐ \
ಊ  ಏ ಈ  ಏ ಉ  ಏ ಇ  ಐ ಊ  ಎ ಋ  ಋ ಐ  ಎ ಏ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ \
ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಉ ಆ  ಉ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ \
ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಉ ಆ  ಆ ಅ  ಆ ಅ  ಆ \
ಅ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಅ ಐ  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಅ ಊ  ಆ ಆ\
 ಅ  ಐ ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಐ \
ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಉ ಉ  ಈ ಇ  ಆ ಅ ಎ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ\
  ಆ ಅ ಅ  ಐ ಎ  ಉ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಉ  ಈ ಉ  ಈ ಉ  ಏ ಇ  ಆ\
 ಅ ಆ  ಐ ಎ  ಆ ಅ ಅ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಐ ಎ  ಆ \
ಆ ಅ  ಆ ಅ ಅ  ಈ ಇ  ಆ ಆ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಎ \
 ಆ ಆ ಋ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಈ ಉ  ಈ ಉ\
  ಈ ಉ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಅ ಇ  ಈ ಇ  ಆ ಅ ಎ  ಐ ಎ  ಆ ಆ ಅ  \
ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಅ  ಐ ಎ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ\
 ಇ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಆ ಅ ಉ  ಐ ಎ  ಐ ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಎ\
 ಊ  ಋ ಊ  ಎ ಏ  ಎ ಏ  ಋ ಊ  ಋ ಏ  ಋ ಊ  ಐ ಊ  ಎ ಋ  ಋ ಐ  ಏ ಉ  ಏ ಉ  ಋ ಐ  ಏ ಇ  ಏ\
 ಈ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಆ  ಆ ಅ ಏ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಊ ಏ  ಆ ಅ  ಈ ಇ\
  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಆ ಅ ಉ  ಐ ಎ  ಐ \
ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಎ ಊ  ಋ ಊ  ಎ ಏ  ಎ ಏ  ಋ ಊ  ಋ ಏ  ಋ ಊ  ಐ ಊ\
  ಎ ಋ  ಋ ಐ  ಏ ಉ  ಏ ಉ  ಋ ಐ  ಏ ಇ  ಏ ಈ  ಈ ಇ  ಈ ಇ  ಈ ಊ  ಈ ಇ  ಎ ಅ  ಆ ಆ ಆ  ಆ\
 ಆ ಉ  ಈ ಇ  ಆ ಆ ಅ  ಆ ಆ ಆ  ಆ ಆ ಐ  ಉ ಉ  ಈ ಇ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಐ  ಐ ಎ  ಆ ಇ \
ಆ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಈ ಇ  ಎ ಊ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ  \
ಆ ಅ ಅ  ಐ ಎ  ಈ ಇ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ \
 ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಐ  ಆ ಅ ಊ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಇ  ಆ \
ಅ ಆ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಉ ಆ  ಈ\
 ಇ  ಐ ಎ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಅ ಇ  ಉ ಉ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಇ \
 ಆ ಅ ಆ  ಆ ಆ ಅ  ಉ ಅ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಐ ಊ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಆ ಅ ಏ  ಆ ಅ\
 ಆ  ಉ ಉ  ಈ ಇ  ಈ ಉ  ಆ ಆ ಐ  ಈ ಉ  ಉ ಆ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಎ\
  ಆ ಆ ಋ  ಐ ಊ  ಆ ಅ ಇ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ \
 ಈ ಊ  ಈ ಇ  ಋ ಊ  ಆ ಆ ಊ  ಆ ಆ ಊ  ಆ ಆ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಅ ಊ  \
ಆ ಆ ಋ  ಈ ಐ  ಆ ಆ ಊ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಅ ಎ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  ಆ ಆ ಉ  ಆ\
 ಅ ಆ  ಐ ಎ  ಆ ಅ ಅ  ಈ ಇ  ಆ ಆ ಋ  ಆ ಅ ಉ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಆ ಆ ಋ  \
ಆ ಅ ಊ  ಆ ಆ ಉ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಈ ಇ  ಆ ಅ \
ಇ  ಆ ಅ ಊ  ಆ ಅ ಏ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಆ ಆ ಆ  ಈ ಇ  ಆ ಅ ಐ  ಆ\
 ಅ ಆ  ಆ ಅ ಐ  ಆ ಆ ಆ  ಆ ಆ ಉ  ಆ ಇ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ\
 ಇ  ಈ ಇ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಐ ಊ  ಆ ಅ ಇ  ಉ ಋ  ಆ ಆ ಐ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ \
ಆ ಋ  ಆ ಅ ಆ  ಉ ಅ  ಆ ಅ ಆ  ಆ ಆ ಅ  ಐ ಐ  ಆ ಆ ಆ  ಆ ಅ ಅ  ಆ ಅ ಆ  ಐ ಊ  ಆ ಆ ಊ  ಆ\
 ಆ ಋ  ಆ ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಅ ಈ  ಉ ಅ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಆ ಅ ಇ  ಉ ಋ  \
ಆ ಆ ಉ  ಆ ಅ ಆ  ಐ ಎ  ಆ ಅ ಅ  ಉ ಅ  ಉ ಆ  ಉ ಉ  ಈ ಇ  ಐ ಎ  ಆ ಅ ಏ  ಆ ಆ ಇ  ಆ ಅ ಉ\
  ಐ ಎ  ಐ ಏ  ಆ ಅ ಆ  ಆ ಆ ಋ  ಉ ಆ  ಉ ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಆ ಇ  ಆ \
ಆ ಉ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಋ  ಉ ಅ  ಈ ಉ  ಐ ಆ  ಐ ಐ ಏ ಐ  ಐ ಈ  ಆ ಅ ಅ  ಆ ಆ ಆ  ಆ\
 ಆ ಅ  ಆ ಅ ಆ  ಈ ಇ  ಆ ಇ ಆ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಉ  ಈ ಇ  ಆ ಅ ಇ  ಆ ಅ ಊ  ಆ ಅ ಏ\
  ಆ ಅ ಆ  ಈ ಇ  ಆ ಆ ಊ  ಆ ಆ ಎ  ಐ ಐ  ಐ ಐ  ಆ ಅ ಆ  ಆ ಆ ಊ  ಆ ಆ ಊ  ಆ ಅ ಇ  ಆ ಆ \
ಎ  ಆ ಅ ಏ  ಆ ಅ ಏ  ಆ ಇ ಆ  ಈ ಇ  ಆ ಆ ಆ  ಐ ಏ  ಆ ಅ ಇ  ಆ ಆ ಎ  ಆ ಆ ಊ  ಐ ಐ  ಐ ಎ\
  ಆ ಆ ಋ  ಆ ಅ ಆ  ಆ ಅ ಅ  ಉ ಋ  ಈ ಉ  ಉ ಆ  ಆ ಅ  ಆ ಅ  ಆ ಅ  ಆ ಅ ಊ  ಆ ಅ ಇ  ಈ ಇ\
  ಐ ಊ  ಐ ಊ  ಆ ಆ ಅ  ಐ ಎ  ಆ ಅ ಐ  ಆ ಅ ಆ  ಐ ಊ  ಐ ಊ  ಈ ಇ  ಋ ಆ  ಋ ಆ  ಈ ಇ  ಈ \
ಉ  ಐ ಊ  ಐ ಊ  ಆ ಅ ಐ  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಐ ಊ  ಐ ಊ  ಈ ಉ  ಊ ಏ  ಆ ಅ  ಈ ಇ  ಈ\
 ಇ  ಈ ಇ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಊ  ಈ ಇ  ಋ ಆ  ಈ ಇ  ಆ ಆ ಉ  ಆ ಆ ಎ  ಆ\
 ಆ ಅ  ಐ ಊ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಆ ಊ  ಆ ಅ ಆ  ಉ ಅ  ಉ \
ಆ  ಆ ಅ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಈ ಇ  ಆ ಅ ಐ  ಐ ಎ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಉ ಅ  ಐ ಎ  ಆ ಆ ಉ \
 ಆ ಅ ಈ  ಆ ಆ ಊ  ಉ ಋ  ಆ ಅ ಊ  ಆ ಆ ಅ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಉ ಉ  ಈ ಇ  ಐ ಎ  \
ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಊ  ಉ ಋ  ಆ ಆ ಆ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಆ ಆ ಇ  ಆ ಆ ಎ  ಆ ಆ ಋ  ಉ \
ಉ  ಈ ಇ  ಐ ಎ  ಆ ಆ ಉ  ಆ ಅ ಈ  ಆ ಆ ಊ  ಉ ಋ  ಆ ಅ ಎ  ಐ ಎ  ಆ ಆ ಅ  ಆ ಆ ಅ  ಐ ಎ  \
ಆ ಅ ಅ  ಐ ಎ  ಉ ಆ"
.split("  ")])))
